-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/data/ransom/NLSYvCPS/Data/NLSY/y79/create_master.log
  log type:  text
 opened on:  11 Feb 2019, 11:55:19

. 
. **************************************************
. * Create all permanent variables and save all data
. **************************************************
. local EY = int(10000*uniform()) // NO seed; needs to be random

. !gunzip -fc raw.dta.gz > tmp`EY'.dta


. use tmp`EY'.dta, clear

. !rm tmp`EY'.dta


. 
. * survey rounds by year
. generat svyRound = .
(431,324 missing values generated)

. replace svyRound =  1 if year==1979
(12,686 real changes made)

. replace svyRound =  2 if year==1980
(12,686 real changes made)

. replace svyRound =  3 if year==1981
(12,686 real changes made)

. replace svyRound =  4 if year==1982
(12,686 real changes made)

. replace svyRound =  5 if year==1983
(12,686 real changes made)

. replace svyRound =  6 if year==1984
(12,686 real changes made)

. replace svyRound =  7 if year==1985
(12,686 real changes made)

. replace svyRound =  8 if year==1986
(12,686 real changes made)

. replace svyRound =  9 if year==1987
(12,686 real changes made)

. replace svyRound = 10 if year==1988
(12,686 real changes made)

. replace svyRound = 11 if year==1989
(12,686 real changes made)

. replace svyRound = 12 if year==1990
(12,686 real changes made)

. replace svyRound = 13 if year==1991
(12,686 real changes made)

. replace svyRound = 14 if year==1992
(12,686 real changes made)

. replace svyRound = 15 if year==1993
(12,686 real changes made)

. replace svyRound = 16 if year==1994
(12,686 real changes made)

. replace svyRound = 17 if year==1995
(0 real changes made)

. replace svyRound = 17 if year==1996
(12,686 real changes made)

. replace svyRound = 18 if year==1997
(0 real changes made)

. replace svyRound = 18 if year==1998
(12,686 real changes made)

. replace svyRound = 19 if year==1999
(0 real changes made)

. replace svyRound = 19 if year==2000
(12,686 real changes made)

. replace svyRound = 20 if year==2001
(0 real changes made)

. replace svyRound = 20 if year==2002
(12,686 real changes made)

. replace svyRound = 21 if year==2003
(0 real changes made)

. replace svyRound = 21 if year==2004
(12,686 real changes made)

. replace svyRound = 22 if year==2005
(0 real changes made)

. replace svyRound = 22 if year==2006
(12,686 real changes made)

. replace svyRound = 23 if year==2007
(0 real changes made)

. replace svyRound = 23 if year==2008
(12,686 real changes made)

. replace svyRound = 24 if year==2009
(0 real changes made)

. replace svyRound = 24 if year==2010
(12,686 real changes made)

. replace svyRound = 25 if year==2011
(0 real changes made)

. replace svyRound = 25 if year==2012
(12,686 real changes made)

. 
. xtset id year
       panel variable:  id (strongly balanced)
        time variable:  year, 1970 to 2012, but with gaps
                delta:  1 unit

. 
. * Bring in data on CPI and minimum wage
. run cpi_min_wage.do

. 
. * Create various demographic variables
. do create_demog.do

. ***************************************************
. * Generate various demographic variables
. ***************************************************
. drop height weight

. 
. * age
. drop  age

. gener age = year-dob_yr1979-1

. label var age "AGE AS OF JAN 1"

. gener birthq  = 1*inrange(dob_mo1979,1,3)+2*inrange(dob_mo1979,4,6)+3*inrange
> (dob_mo1979,7,9)+4*inrange(dob_mo1979,10,12)

. gener birthmo = dob_mo1979

. gener birthyr = dob_yr1979

. 
. * parental education
. generat m_hgcMoth = (hgcMoth>=.)

. replace hgcMoth = 0 if m_hgcMoth==1
(27,472 real changes made)

. generat m_hgcFath = (hgcFath>=.)

. replace hgcFath = 0 if m_hgcFath==1
(61,404 real changes made)

. label var m_hgcMoth "MISSING MOTHER'S HGC"

. label var m_hgcFath "MISSING FATHER'S HGC"

. 
. * Fix AFQT variables
. generat m_afqt = mi(afqt)

. replace afqt   = 0 if mi(afqt)
(27,472 real changes made)

. foreach var in AR CS MK NO PC WK {
  2.     generat m_asvab`var' = mi(asvab`var')
  3.     replace asvab`var' = 0 if mi(asvab`var')
  4. }
(27,472 real changes made)
(27,472 real changes made)
(27,472 real changes made)
(27,472 real changes made)
(27,472 real changes made)
(27,472 real changes made)

. 
. * Check all missings accounted for
. foreach V in hgcMoth hgcFath afqt asvabAR asvabCS asvabMK asvabNO asvabPC asv
> abWK {
  2.     assert !missing( `V')
  3.     count if m_`V'
  4.     assert r(N)~=0
  5. }
  27,472
  61,404
  27,472
  27,472
  27,472
  27,472
  27,472
  27,472
  27,472

. 
. * foreignBorn
. gen foreignBorn = country_born==2

. label var foreignBorn "FOREIGN BORN DUMMY"

. 
. * year entered us if foreign born
. replace yearEnteredUS = yearEnteredUS+1900 if yearEnteredUS<.
variable yearEnteredUS was byte now int
(28,900 real changes made)

. 
. * race
. gen black    = race_screen==2

. gen hispanic = race_screen==1

. gen white    = race_screen==3 & ~inlist(ethnicity,2,13,14,26)

. gen asian    = race_screen==3 &  inlist(ethnicity,2,13,14,26)

. gen race     = 1 if white
(176,426 missing values generated)

. replace race = 2 if black
(107,916 real changes made)

. replace race = 3 if hispanic
(68,068 real changes made)

. replace race = 4 if asian
(442 real changes made)

. assert race != 0

. lab var white "WHITE"

. lab var black "BLACK"

. lab var hispanic "HISPANIC"

. lab var asian "ASIAN"

. lab var race "RACE"

. 
. * female
. gen female = sex==2

. label var female "FEMALE"

. 
. * birth cohorts
. gen     born1957 = dob_yr==1957

. gen     born1958 = dob_yr==1958

. gen     born1959 = dob_yr==1959

. gen     born1960 = dob_yr==1960

. gen     born1961 = dob_yr==1961

. gen     born1962 = dob_yr==1962

. gen     born1963 = dob_yr==1963

. gen     born1964 = dob_yr==1964

. lab var born1957 "BIRTH COHORT DUMMY 1957"

. lab var born1958 "BIRTH COHORT DUMMY 1958"

. lab var born1959 "BIRTH COHORT DUMMY 1959"

. lab var born1960 "BIRTH COHORT DUMMY 1960"

. lab var born1961 "BIRTH COHORT DUMMY 1961"

. lab var born1962 "BIRTH COHORT DUMMY 1962"

. lab var born1963 "BIRTH COHORT DUMMY 1963"

. lab var born1964 "BIRTH COHORT DUMMY 1964"

. 
. * live with mom at 14
. gen       liveWithMom14  = (live_with_14==11) | (live_with_14==21) | (live_wi
> th_14==31) | (live_with_14==41) | (live_with_14==51) | (live_with_14==91)

. label var liveWithMom14  "LIVE WITH MOTHER AT AGE 14"

. gen       femaleHeadHH14 = (live_with_14==51) | (live_with_14==52) | (live_wi
> th_14==53) | (live_with_14==54) | (live_with_14==91) | (live_with_14==93)

. label var femaleHeadHH14 "FEMALE HEADED HOUSEHOLD AT AGE 14"

. 
. * oversample dummies
. gen     oversampleRace     = (sample_id==10 | sample_id==11 | sample_id==13 |
>  sample_id==14)

. gen     oversamplePoor     = (sample_id==9  | sample_id==12)

. gen     oversampleMilitary = (sample_id>=15 & sample_id<= 20)

. lab var oversampleRace     "OVERSAMPLE - BLACKS AND HISPANICS"

. lab var oversamplePoor     "OVERSAMPLE - POOR WHITES"

. lab var oversampleMilitary "OVERSAMPLE - MILITARY"

. 
. * deflate family income
. sort id year

. ren famInc1978 famIncAsTeen

. by id: replace famIncAsTeen = famIncAsTeen/cpi[9]
(429,658 real changes made, 84,694 to missing)

. replace famIncAsTeen = 1 if famIncAsTeen<=0
(1,666 real changes made)

. generat lnfamIncAsTeen = ln(famIncAsTeen)
(84,694 missing values generated)

. replace famIncAsTeen = famIncAsTeen/1000
(346,630 real changes made)

. 
. generat m_famIncAsTeen=(famIncAsTeen>=.)

. replace famIncAsTeen = 0 if m_famIncAsTeen==1
(84,694 real changes made)

. lab var famIncAsTeen   "FAMILY INCOME IN 1978, 1000's of 1982-4 $"

. lab var lnfamIncAsTeen "LOG FAMILY INCOME IN 1978, 1982-4 $"

. lab var m_famIncAsTeen "MISSING FAMILY INCOME IN 1978"

. 
. * weights
. rename      svywgt svywgt_cross

. gen         svywgt_temp = svywgt_cross if year==1979
(418,638 missing values generated)

. by id: egen svywgt = max(svywgt_temp)

. drop        svywgt_temp

. lab var     svywgt "WEIGHT FROM FIRST YEAR OF SURVEY"

. 
. *============================================================================
. * missed interviews
. * variables that flag if the year is missing, how long the missing has 
. *  gone on, how long the missing lasts, and if it's the last missing spell
. *  Also, variables that list whether the element is the first after a spell
. *  and the last year of data before the spell.
. *============================================================================
. gen         missInt = ~mi(reason_noninterview)

. bys id (year): egen everMissInt = max(missInt)

. gen         ageAtMissInt = age*missInt

. gen         yearMissInt = year*missInt

. bys id (year): egen yrFirstMissInt = min(yearMissInt) if yearMissInt>0
(357815 missing values generated)

. bys id (year): egen yrFirstMissIntFull = mean(yrFirstMissInt)
(170442 missing values generated)

. gen         missIntEverBefore = year>=yrFirstMissIntFull

. 
. gen            missIntCum = 0

. by id: replace missIntCum = missIntCum[_n-1] + 1 if missInt[_n]==1
(73,509 real changes made)

. 
. gsort +id -year

. gen            missIntLength = missIntCum

. by id: replace missIntLength = missIntLength[_n-1] if missIntCum[_n]!=0 & mis
> sIntCum[_n-1]!=0 & year<1994
(22,900 real changes made)

. 
. gen            missIntLastSpell = 0

. by id: replace missIntLastSpell = 1 if missIntCum[_n]!=0 & (year==1994 | miss
> IntLastSpell[_n-1]==1)
(23,963 real changes made)

. sort id year

. 
. by id: gen     missIntEnd = (missInt[_n-1]==1) & (missInt[_n]==0) & (year<=19
> 94)

. 
. by id: gen     missIntEndLength = missIntEnd[_n]*missIntLength[_n-1]
(12,686 missing values generated)

. replace        missIntEndLength = 0 if year==1970
(12,686 real changes made)

. 
. gen            missIntFirstYear = 0

. by id: replace missIntFirstYear = year[_n]               if missIntCum[_n]==1
(11,596 real changes made)

. by id: replace missIntFirstYear = missIntFirstYear[_n-1] if missIntCum[_n]>1
(61,913 real changes made)

. 
. gen            missIntLongestSpellYet = missIntLength

. by id: replace missIntLongestSpellYet = missIntLongestSpellYet[_n-1] if missI
> ntLongestSpellYet<missIntLongestSpellYet[_n-1] & _n>1
(36,428 real changes made)

. 
. by id: gen     missIntInvalidPeriod   = missIntLongestSpellYet[_n]>=3 | missI
> ntLastSpell[_n]==1

. 
. by id: gen     lastValidInt           = missIntInvalidPeriod[_n]==0 & missInt
> InvalidPeriod[_n+1]==1

. 
. gen            temp_date              = mdy(interview_mo,1,year) if lastValid
> Int
(427,138 missing values generated)

. by id: egen    lastValidIntDate       = max(temp_date)
(289000 missing values generated)

. format         lastValidIntDate %td

. drop           temp_date

. 
. gen            temp_date              = mdy(interview_mo,1,year) if missIntLa
> stSpell==0 & missIntLastSpell[_n+1]==1
(427,529 missing values generated)

. by id: egen    beforeLastSpellIntDate = max(temp_date)
(302294 missing values generated)

. format         beforeLastSpellIntDate %td

. drop           temp_date

. 
. label var missInt                "MISSED INTERVIEW IN CURRENT YEAR"

. label var missIntCum             "RUNNING TALLY OF CURRENT MISSED INTERVIEW S
> PELL"

. label var missIntLength          "LENGTH OF CURRENT MISSED INTERVIEW SPELL"

. label var missIntLastSpell       "ELEMENT OF LAST MISSED INTERVIEW SPELL"

. label var missIntEnd             "FIRST OBS AFTER MISSED INTERVIEW SPELL"

. label var missIntEndLength       "LENGTH OF MISSED INTERVIEW SPELL THAT ENDED
>  THE PREVIOUS YEAR"

. label var missIntFirstYear       "YEAR OF FIRST OBS OF MISSED INTERVIEW SPELL
> " 

. label var missIntLongestSpellYet "LENGTH OF LONGEST SPELL INDIV HAS EXPERIENC
> E BY T"

. label var missIntInvalidPeriod   "ELEMENT OF INVALID INTERVIEW PERIOD"

. label var lastValidInt           "LAST VALID INTERVIEW"

. label var lastValidIntDate       "DATE OF LAST VALID INTERVIEW"

. 
. foreach x of numlist 1/25 {
  2.     local temp=`x'+9
  3.     bys id: gen R`x'interviewDate  = ym(interview_yr[`temp'],interview_mo[
> `temp'])
  4.     format R`x'interviewDate %tm
  5. }
(18,530 missing values generated)
(16,694 missing values generated)
(19,142 missing values generated)
(15,810 missing values generated)
(20,978 missing values generated)
(60,928 missing values generated)
(69,054 missing values generated)
(74,834 missing values generated)
(75,514 missing values generated)
(70,754 missing values generated)
(76,534 missing values generated)
(124,712 missing values generated)
(124,780 missing values generated)
(124,950 missing values generated)
(129,098 missing values generated)
(137,700 missing values generated)
(145,758 missing values generated)
(158,202 missing values generated)
(168,708 missing values generated)
(170,850 missing values generated)
(171,088 missing values generated)
(167,586 missing values generated)
(174,114 missing values generated)
(183,090 missing values generated)

. 
. * get proportion of people who ever missed any number of consecutive intervie
> ws
. foreach x of numlist 1/11 {
  2.     by id: gen miss_`x'_intA  = (missIntLength==`x')
  3. }

. foreach x of numlist 1/11 {
  2.     by id: egen miss_`x'_intB  = mean(miss_`x'_intA )
  3. }

. foreach x of numlist 1/11 {
  2.     by id: gen ever_miss_`x'_int  = (miss_`x'_intB >0)
  3. }

. drop miss_*intA miss_*intB

. 
. gen everMiss3plusInt = ((ever_miss_3_int)|(ever_miss_4_int)|(ever_miss_5_int)
> |(ever_miss_6_int)|(ever_miss_7_int)|(ever_miss_8_int)|(ever_miss_9_int)|(eve
> r_miss_10_int)|(ever_miss_11_int))

. 
. * get proportion of people who return after missing any number of consecutive
>  interviews
. foreach x of numlist 1/11 {
  2.     by id: gen return_after_`x'_miss_intA  = (missIntLength[_n-1]==`x'  & 
> missIntLength[_n]==0 & year<=1994)
  3. }

. foreach x of numlist 1/11 {
  2.     by id: egen return_after_`x'_miss_intB  = mean(return_after_`x'_miss_i
> ntA  & year<=1994)
  3. }

. foreach x of numlist 1/11 {
  2.     by id: gen ever_return_after_`x'_miss_int  = (return_after_`x'_miss_in
> tB >0  & year<=1994)
  3. }

. drop return_after*A return_after*B

. 
. gen everReturnAfter3plusMissInt = ((ever_return_after_3_miss_int)|(ever_retur
> n_after_4_miss_int)|(ever_return_after_5_miss_int)|(ever_return_after_6_miss_
> int)|(ever_return_after_7_miss_int)|(ever_return_after_8_miss_int)|(ever_retu
> rn_after_9_miss_int)|(ever_return_after_10_miss_int)|(ever_return_after_11_mi
> ss_int))

. 
. * Count number of people who have multiple missing interview spells lasting d
> ifferent lengths
. foreach x of numlist 1/11 {
  2.     count if ever_return_after_1_miss_int ==1 & ever_return_after_`x'_miss
> _int==1 & year==1979
  3. }
  1,907
  171
  72
  40
  21
  6
  11
  4
  1
  0
  1

. foreach x of numlist 2/11 {
  2.     count if ever_return_after_2_miss_int ==1 & ever_return_after_`x'_miss
> _int==1 & year==1979
  3. }
  485
  28
  11
  8
  2
  1
  1
  0
  0
  0

. foreach x of numlist 3/11 {
  2.     count if ever_return_after_3_miss_int ==1 & ever_return_after_`x'_miss
> _int==1 & year==1979
  3. }
  241
  12
  3
  1
  0
  0
  0
  0
  0

. foreach x of numlist 4/11 {
  2.     count if ever_return_after_4_miss_int ==1 & ever_return_after_`x'_miss
> _int==1 & year==1979
  3. }
  132
  0
  1
  0
  0
  0
  0
  0

. foreach x of numlist 5/11 {
  2.     count if ever_return_after_5_miss_int ==1 & ever_return_after_`x'_miss
> _int==1 & year==1979
  3. }
  76
  2
  0
  0
  0
  0
  0

. foreach x of numlist 6/11 {
  2.     count if ever_return_after_6_miss_int ==1 & ever_return_after_`x'_miss
> _int==1 & year==1979
  3. }
  46
  0
  0
  0
  0
  0

. foreach x of numlist 7/11 {
  2.     count if ever_return_after_7_miss_int ==1 & ever_return_after_`x'_miss
> _int==1 & year==1979
  3. }
  39
  0
  0
  0
  0

. foreach x of numlist 8/11 {
  2.     count if ever_return_after_8_miss_int ==1 & ever_return_after_`x'_miss
> _int==1 & year==1979
  3. }
  25
  0
  0
  0

. foreach x of numlist 9/11 {
  2.     count if ever_return_after_9_miss_int ==1 & ever_return_after_`x'_miss
> _int==1 & year==1979
  3. }
  15
  0
  0

. foreach x of numlist 10/11 {
  2.     count if ever_return_after_10_miss_int ==1 & ever_return_after_`x'_mis
> s_int==1 & year==1979
  3. }
  8
  0

. foreach x of numlist 11/11 {
  2.     count if ever_return_after_11_miss_int ==1 & ever_return_after_`x'_mis
> s_int==1 & year==1979
  3. }
  8

. 
. foreach x of numlist 1/11 {
  2.     sum ever_return_after_`x'_miss_int if ever_miss_`x'_int==1 & year==197
> 9
  3. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~_1_miss_int |      4,623    .4125027    .4923379          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
e~2_miss_int |      2,698    .1797628    .3840609          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
e~3_miss_int |      2,010    .1199005     .324926          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
e~4_miss_int |      3,112    .0424165    .2015697          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
e~5_miss_int |      2,880    .0263889    .1603167          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
e~6_miss_int |      2,704    .0170118    .1293392          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
e~7_miss_int |      2,522    .0154639    .1234132          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
e~8_miss_int |      2,351    .0106338    .1025923          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
e~9_miss_int |      2,267    .0066167    .0810913          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
e~0_miss_int |      3,218     .002486    .0498057          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
~11_miss_int |      3,204    .0024969    .0499141          0          1

. 
. sum everReturnAfter3plusMissInt if everMiss3plusInt==1 & year==1979

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
everReturn~t |      5,181    .1102104     .313182          0          1

. 
. tab ageAtMissInt if ageAtMissInt>0, mi

ageAtMissIn |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
         15 |         35        0.05        0.05
         16 |         78        0.11        0.15
         17 |        123        0.17        0.32
         18 |        169        0.23        0.55
         19 |        297        0.40        0.95
         20 |        373        0.51        1.46
         21 |        523        0.71        2.17
         22 |        673        0.92        3.09
         23 |        778        1.06        4.15
         24 |      1,011        1.38        5.52
         25 |      1,355        1.84        7.37
         26 |      1,905        2.59        9.96
         27 |      2,475        3.37       13.32
         28 |      2,656        3.61       16.94
         29 |      2,843        3.87       20.81
         30 |      2,767        3.76       24.57
         31 |      2,936        3.99       28.56
         32 |      2,943        4.00       32.57
         33 |      3,188        4.34       36.90
         34 |      2,843        3.87       40.77
         35 |      2,670        3.63       44.40
         36 |      2,305        3.14       47.54
         37 |      2,076        2.82       50.36
         38 |      2,431        3.31       53.67
         39 |      2,212        3.01       56.68
         40 |      2,509        3.41       60.09
         41 |      2,314        3.15       63.24
         42 |      2,607        3.55       66.79
         43 |      2,360        3.21       70.00
         44 |      2,620        3.56       73.56
         45 |      2,383        3.24       76.80
         46 |      2,636        3.59       80.39
         47 |      2,424        3.30       83.69
         48 |      2,708        3.68       87.37
         49 |      2,012        2.74       90.11
         50 |      2,202        3.00       93.10
         51 |      1,533        2.09       95.19
         52 |      1,737        2.36       97.55
         53 |        893        1.21       98.77
         54 |        906        1.23      100.00
------------+-----------------------------------
      Total |     73,509      100.00

. tab ageAtMissInt dob_yr if ageAtMissInt>0, mi col nofreq

ageAtMissI |                   DATE OF BIRTH - YR
        nt |      1957       1958       1959       1960       1961 |     Total
-----------+-------------------------------------------------------+----------
        15 |      0.00       0.00       0.00       0.00       0.00 |      0.05 
        16 |      0.00       0.00       0.00       0.00       0.00 |      0.11 
        17 |      0.00       0.00       0.00       0.00       0.00 |      0.17 
        18 |      0.00       0.00       0.00       0.00       0.74 |      0.23 
        19 |      0.00       0.00       0.00       1.02       0.80 |      0.40 
        20 |      0.00       0.00       0.73       0.73       0.88 |      0.51 
        21 |      0.00       0.72       0.69       0.81       0.79 |      0.71 
        22 |      0.61       0.64       0.73       0.60       1.01 |      0.92 
        23 |      0.64       0.77       0.59       0.87       1.31 |      1.06 
        24 |      0.64       0.62       0.73       2.69       2.02 |      1.38 
        25 |      0.54       0.76       3.10       2.93       2.45 |      1.84 
        26 |      0.75       3.12       3.23       3.09       2.39 |      2.59 
        27 |      3.19       3.29       3.46       3.17       2.10 |      3.37 
        28 |      3.45       3.39       3.39       3.03       2.49 |      3.61 
        29 |      3.68       3.51       3.28       3.20       4.68 |      3.87 
        30 |      3.58       3.34       3.52       4.84       4.68 |      3.76 
        31 |      3.43       3.47       5.10       4.85       4.70 |      3.99 
        32 |      3.49       5.10       5.15       4.81       4.92 |      4.00 
        33 |      5.26       5.11       5.15       4.93       0.00 |      4.34 
        34 |      5.24       5.10       5.35       0.00       5.53 |      3.87 
        35 |      5.29       5.24       0.00       5.39       0.00 |      3.63 
        36 |      5.38       0.00       5.59       0.00       6.11 |      3.14 
        37 |      0.00       5.47       0.00       5.65       0.00 |      2.82 
        38 |      5.45       0.00       5.74       0.00       6.89 |      3.31 
        39 |      0.00       5.63       0.00       6.27       0.00 |      3.01 
        40 |      5.66       0.00       6.00       0.00       7.30 |      3.41 
        41 |      0.00       5.96       0.00       6.75       0.00 |      3.15 
        42 |      5.93       0.00       6.36       0.00       7.47 |      3.55 
        43 |      0.00       6.34       0.00       6.88       0.00 |      3.21 
        44 |      6.15       0.00       6.40       0.00       7.47 |      3.56 
        45 |      0.00       6.39       0.00       6.83       0.00 |      3.24 
        46 |      6.18       0.00       6.29       0.00       7.31 |      3.59 
        47 |      0.00       6.46       0.00       6.62       0.00 |      3.30 
        48 |      6.29       0.00       6.27       0.00       7.86 |      3.68 
        49 |      0.00       6.32       0.00       6.70       0.00 |      2.74 
        50 |      6.21       0.00       6.48       0.00       8.10 |      3.00 
        51 |      0.00       6.52       0.00       7.34       0.00 |      2.09 
        52 |      6.33       0.00       6.66       0.00       0.00 |      2.36 
        53 |      0.00       6.70       0.00       0.00       0.00 |      1.21 
        54 |      6.62       0.00       0.00       0.00       0.00 |      1.23 
-----------+-------------------------------------------------------+----------
     Total |    100.00     100.00     100.00     100.00     100.00 |    100.00 


ageAtMissI |        DATE OF BIRTH - YR
        nt |      1962       1963       1964 |     Total
-----------+---------------------------------+----------
        15 |      0.00       0.00       0.70 |      0.05 
        16 |      0.00       0.72       0.62 |      0.11 
        17 |      0.75       0.58       0.70 |      0.17 
        18 |      0.66       0.70       0.66 |      0.23 
        19 |      1.01       0.64       0.92 |      0.40 
        20 |      0.80       0.89       0.92 |      0.51 
        21 |      1.09       1.10       1.42 |      0.71 
        22 |      1.39       1.70       1.76 |      0.92 
        23 |      1.89       2.01       1.88 |      1.06 
        24 |      2.13       2.37       1.58 |      1.38 
        25 |      2.04       1.97       1.86 |      1.84 
        26 |      1.89       2.43       5.05 |      2.59 
        27 |      2.32       4.91       5.11 |      3.37 
        28 |      4.51       4.85       4.89 |      3.61 
        29 |      4.46       4.90       4.91 |      3.87 
        30 |      4.62       5.14       0.00 |      3.76 
        31 |      4.95       0.00       5.57 |      3.99 
        32 |      0.00       5.68       0.00 |      4.00 
        33 |      5.49       0.00       6.10 |      4.34 
        34 |      0.00       6.15       0.00 |      3.87 
        35 |      6.23       0.00       6.98 |      3.63 
        36 |      0.00       7.00       0.00 |      3.14 
        37 |      6.95       0.00       7.52 |      2.82 
        38 |      0.00       7.73       0.00 |      3.31 
        39 |      7.51       0.00       7.96 |      3.01 
        40 |      0.00       7.56       0.00 |      3.41 
        41 |      7.72       0.00       7.98 |      3.15 
        42 |      0.00       7.62       0.00 |      3.55 
        43 |      7.66       0.00       7.72 |      3.21 
        44 |      0.00       7.27       0.00 |      3.56 
        45 |      7.59       0.00       8.24 |      3.24 
        46 |      0.00       7.82       0.00 |      3.59 
        47 |      7.84       0.00       8.90 |      3.30 
        48 |      0.00       8.24       0.00 |      3.68 
        49 |      8.51       0.00       0.00 |      2.74 
        50 |      0.00       0.00       0.00 |      3.00 
        51 |      0.00       0.00       0.00 |      2.09 
        52 |      0.00       0.00       0.00 |      2.36 
        53 |      0.00       0.00       0.00 |      1.21 
        54 |      0.00       0.00       0.00 |      1.23 
-----------+---------------------------------+----------
     Total |    100.00     100.00     100.00 |    100.00 


. tab yearMissInt if yearMissInt>0, mi

yearMissInt |      Freq.     Percent        Cum.
------------+-----------------------------------
       1980 |        545        0.74        0.74
       1981 |        491        0.67        1.41
       1982 |        563        0.77        2.18
       1983 |        465        0.63        2.81
       1984 |        617        0.84        3.65
       1985 |      1,792        2.44        6.08
       1986 |      2,031        2.76        8.85
       1987 |      2,201        2.99       11.84
       1988 |      2,221        3.02       14.86
       1989 |      2,081        2.83       17.69
       1990 |      2,250        3.06       20.76
       1991 |      3,668        4.99       25.75
       1992 |      3,670        4.99       30.74
       1993 |      3,675        5.00       35.74
       1994 |      3,795        5.16       40.90
       1996 |      4,050        5.51       46.41
       1998 |      4,287        5.83       52.24
       2000 |      4,653        6.33       58.57
       2002 |      4,962        6.75       65.32
       2004 |      5,025        6.84       72.16
       2006 |      5,032        6.85       79.00
       2008 |      4,929        6.71       85.71
       2010 |      5,121        6.97       92.67
       2012 |      5,385        7.33      100.00
------------+-----------------------------------
      Total |     73,509      100.00

. 
. 
. lab var birthq  "Quarter of birth"

. lab var birthmo "Month of birth"

. lab var birthyr "Year of birth"

. 
. ** Variables to keep:
. global keeperdemog id year svyRound age birthq birthmo birthyr hgcMoth m_hgcM
> oth m_hgcFath hgcFath asvab* m_asvab* afqt m_afqt rotter_score famIncAsTeen l
> nfamIncAsTeen m_famIncAsTeen svywgt *iss* lastValid* foreignBorn yearEnteredU
> S black hispanic white asian race female born* liveWithMom14 femaleHeadHH14 o
> versample*

. 
end of do-file

. 
. * Create enrollment status and hgc
. do create_school.do

. * Highest grade completed
. gen hgc = high_grade_comp_May
(188,044 missing values generated)

. 
. gen grad4yr  = hgc>=16 & ~mi(hgc)

. gen gradGrad = inlist(high_deg_recd,5,6,7)

. 
. bys id (year): egen maxged = max(diploma_or_ged)
(61132 missing values generated)

. gen ged = inlist(maxged,2,3)

. 
. gen gradHS  = (hgc>=12 & ~mi(hgc)) | ged

. 
. replace gradHS   = .n if !mi(reason_noninterview)
(73,509 real changes made, 73,509 to missing)

. replace grad4yr  = .n if !mi(reason_noninterview)
(73,509 real changes made, 73,509 to missing)

. replace gradGrad = .n if !mi(reason_noninterview)
(73,509 real changes made, 73,509 to missing)

. 
. lab var hgc            "Highest Grade Completed (years)"

. lab var ged            "Holds a GED"

. lab var gradHS         "Absorbing indicator for HS graduation (or GED)"

. lab var grad4yr        "Absorbing indicator for 4-year college graduation"

. lab var gradGrad       "Absorbing indicator for earning graduate degree"

. 
. generat enrolled = inlist(enroll_status_svy,2,3)

. replace enrolled = 0  if year>2006
(0 real changes made)

. replace enrolled = .n if !mi(reason_noninterview)
(73,509 real changes made, 73,509 to missing)

. 
. ** Variables to keep:
. global keeperschool hgc ged gradHS grad4yr gradGrad enrolled

. 
end of do-file

. 
. * Create work status vars, wages, and job characteristics
. do create_work.do

. * create outcomes for the main job in each year: (if someone is working multi
> ple jobs, break ties with lower numbered job
. egen numIntWeekJobs = rowtotal(intWeekWorking*)

. * replace intWeekWorking
. 
. gen wage  = .
(431,324 missing values generated)

. gen hours = .
(431,324 missing values generated)

. gen occ   = .
(431,324 missing values generated)

. gen ind   = .
(431,324 missing values generated)

. gen class = .
(431,324 missing values generated)

. forvalues x=59(-1)1 {
  2.     qui replace wage  = wage`x'  if intWeekWorking`x'==1
  3.     qui replace hours = hours`x' if intWeekWorking`x'==1
  4.     qui replace occ   = occ`x'   if intWeekWorking`x'==1
  5.     qui replace ind   = ind`x'   if intWeekWorking`x'==1
  6.     qui replace class = class`x' if intWeekWorking`x'==1
  7. }

. generat selfemp = class==3

. 
. qui replace wage  = wksWorkLastYr if wksWorkLastYr>=.

. qui replace hours = wksWorkLastYr if wksWorkLastYr>=.

. qui replace occ   = wksWorkLastYr if wksWorkLastYr>=.

. qui replace ind   = wksWorkLastYr if wksWorkLastYr>=.

. qui replace class = wksWorkLastYr if wksWorkLastYr>=.

. 
. * deflate wages
. qui generat wagereal = wage/(100*cpi)

. 
. * top- and bottom-code wages at $2 and $100
. local top_limit 100

. local bot_limit 2

. sum wagereal, d

                          wagereal
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .7795957              0
 5%     2.825279              0
10%     3.368623              0       Obs             157,715
25%     4.329004              0       Sum of Wgt.     157,715

50%     6.256015                      Mean           10.77276
                        Largest       Std. Dev.       250.002
75%     9.385965       24193.55
90%      13.5119        26612.9       Variance       62500.98
95%     17.31602       41522.49       Skewness       118.5122
99%     33.35186       45915.05       Kurtosis       16396.27

. qui replace wagereal = `top_limit' if wagereal>=`top_limit' & ~mi(wagereal)

. qui replace wagereal = `bot_limit' if wagereal<=`bot_limit' & ~mi(wagereal)

. sum wagereal, d

                          wagereal
-------------------------------------------------------------
      Percentiles      Smallest
 1%            2              2
 5%     2.825279              2
10%     3.368623              2       Obs             157,715
25%     4.329004              2       Sum of Wgt.     157,715

50%     6.256015                      Mean           7.955729
                        Largest       Std. Dev.       7.14384
75%     9.385965            100
90%      13.5119            100       Variance       51.03445
95%     17.31602            100       Skewness       6.407293
99%     33.35186            100       Kurtosis       68.26485

. 
. * create log wage
. qui generat lnwage   = ln(wagereal)

. qui replace lnwage = occ if lnwage>=. & occ>=.

. 
. * work experience
. generat empFT = inrange(wksWorkLastYr,40.01,.) & inrange(hours,34.01,.)

. generat empPT = (inrange(wksWorkLastYr,0,40) & inrange(hours,0,.)) | (inrange
> (hours,0,34) & inrange(wksWorkLastYr,0,.))

. replace empFT = . if mi(hours)
(266,530 real changes made, 266,530 to missing)

. replace empPT = . if mi(hours)
(266,530 real changes made, 266,530 to missing)

. bys id (year): generat exper = sum(L.empFT)+.5*sum(L.empPT)

. l id year wksWorkLastYr hours empFT empPT exper in 1/100, sepby(id)

     +------------------------------------------------------+
     | id   year   wksWor~r   hours   empFT   empPT   exper |
     |------------------------------------------------------|
  1. |  1   1970          .       .       .       .       0 |
  2. |  1   1971          .       .       .       .       0 |
  3. |  1   1972          .       .       .       .       0 |
  4. |  1   1973          .       .       .       .       0 |
  5. |  1   1974          .       .       .       .       0 |
  6. |  1   1975          .       .       .       .       0 |
  7. |  1   1976          .       .       .       .       0 |
  8. |  1   1977          .       .       .       .       0 |
  9. |  1   1978          .       .       .       .       0 |
 10. |  1   1979         52      38       1       0       0 |
 11. |  1   1980         .n      .n       .       .       1 |
 12. |  1   1981         52      38       1       0       1 |
 13. |  1   1982         .n      .n       .       .       2 |
 14. |  1   1983         .n      .n       .       .       2 |
 15. |  1   1984         .n      .n       .       .       2 |
 16. |  1   1985         .n      .n       .       .       2 |
 17. |  1   1986         .n      .n       .       .       2 |
 18. |  1   1987         .n      .n       .       .       2 |
 19. |  1   1988         .n      .n       .       .       2 |
 20. |  1   1989         .n      .n       .       .       2 |
 21. |  1   1990         .n      .n       .       .       2 |
 22. |  1   1991         .n      .n       .       .       2 |
 23. |  1   1992         .n      .n       .       .       2 |
 24. |  1   1993         .n      .n       .       .       2 |
 25. |  1   1994         .n      .n       .       .       2 |
 26. |  1   1996         .n      .n       .       .       2 |
 27. |  1   1998         .n      .n       .       .       2 |
 28. |  1   2000         .n      .n       .       .       2 |
 29. |  1   2002         .n      .n       .       .       2 |
 30. |  1   2004         .n      .n       .       .       2 |
 31. |  1   2006         .n      .n       .       .       2 |
 32. |  1   2008         .n      .n       .       .       2 |
 33. |  1   2010         .n      .n       .       .       2 |
 34. |  1   2012         .n      .n       .       .       2 |
     |------------------------------------------------------|
 35. |  2   1970          .       .       .       .       0 |
 36. |  2   1971          .       .       .       .       0 |
 37. |  2   1972          .       .       .       .       0 |
 38. |  2   1973          .       .       .       .       0 |
 39. |  2   1974          .       .       .       .       0 |
 40. |  2   1975          .       .       .       .       0 |
 41. |  2   1976          .       .       .       .       0 |
 42. |  2   1977          .       .       .       .       0 |
 43. |  2   1978          .       .       .       .       0 |
 44. |  2   1979         34      35       0       1       0 |
 45. |  2   1980         52      35       1       0      .5 |
 46. |  2   1981         52      35       1       0     1.5 |
 47. |  2   1982         52      35       1       0     2.5 |
 48. |  2   1983         52      35       1       0     3.5 |
 49. |  2   1984         52      35       1       0     4.5 |
 50. |  2   1985         52      35       1       0     5.5 |
 51. |  2   1986         52      35       1       0     6.5 |
 52. |  2   1987         52      35       1       0     7.5 |
 53. |  2   1988         52      35       1       0     8.5 |
 54. |  2   1989         52      35       1       0     9.5 |
 55. |  2   1990         52      35       1       0    10.5 |
 56. |  2   1991         52      35       1       0    11.5 |
 57. |  2   1992         52      35       1       0    12.5 |
 58. |  2   1993         52       .       .       .    13.5 |
 59. |  2   1994          5       .       .       .    13.5 |
 60. |  2   1996          0       .       .       .    13.5 |
 61. |  2   1998          0       .       .       .    13.5 |
 62. |  2   2000          0       .       .       .    13.5 |
 63. |  2   2002          0       .       .       .    13.5 |
 64. |  2   2004         18      16       0       1    13.5 |
 65. |  2   2006         52      18       0       1    13.5 |
 66. |  2   2008         52      17       0       1    13.5 |
 67. |  2   2010         52      17       0       1    13.5 |
 68. |  2   2012         52      35       1       0    13.5 |
     |------------------------------------------------------|
 69. |  3   1970          .       .       .       .       0 |
 70. |  3   1971          .       .       .       .       0 |
 71. |  3   1972          .       .       .       .       0 |
 72. |  3   1973          .       .       .       .       0 |
 73. |  3   1974          .       .       .       .       0 |
 74. |  3   1975          .       .       .       .       0 |
 75. |  3   1976          .       .       .       .       0 |
 76. |  3   1977          .       .       .       .       0 |
 77. |  3   1978          .       .       .       .       0 |
 78. |  3   1979         38      35       0       1       0 |
 79. |  3   1980         40      37       0       1      .5 |
 80. |  3   1981         .n      .n       .       .       1 |
 81. |  3   1982         19       .       .       .       1 |
 82. |  3   1983          0       .       .       .       1 |
 83. |  3   1984          0       .       .       .       1 |
 84. |  3   1985         23       .       .       .       1 |
 85. |  3   1986          0       .       .       .       1 |
 86. |  3   1987         24       .       .       .       1 |
 87. |  3   1988          7       .       .       .       1 |
 88. |  3   1989         15      50       0       1       1 |
 89. |  3   1990         39       .       .       .     1.5 |
 90. |  3   1991          0      35       0       1     1.5 |
 91. |  3   1992         20      50       0       1       2 |
 92. |  3   1993         52       .       .       .     2.5 |
 93. |  3   1994          3       .       .       .     2.5 |
 94. |  3   1996          0       .       .       .     2.5 |
 95. |  3   1998         10       .       .       .     2.5 |
 96. |  3   2000         52      70       1       0     2.5 |
 97. |  3   2002          0      80       0       1     2.5 |
 98. |  3   2004         .n      .n       .       .     2.5 |
 99. |  3   2006         43      60       1       0     2.5 |
100. |  3   2008          1      60       0       1     2.5 |
     +------------------------------------------------------+

. 
. * Vote behavior
. generat voter = inlist(vote,3,4)

. replace voter = vote if mi(vote)
(423,652 real changes made, 423,652 to missing)

. 
. lab var lnwage   "Log hourly wage, in 1982-84 $"

. lab var exper    "Work experience (cum. # years 40+ weeks worked)"

. lab var hours    "Usual hours per week at main job"

. lab var occ      "Occupation of main job"

. lab var ind      "Industry of main job"

. lab var class    "Class of main job"

. lab var selfemp  "Dummy for whether main job is self-employed"

. 
. ** Variables to keep:
. global keeperwork lnwage exper hours empPT empFT occ ind class hours* occ* wa
> ge* intWeekWorking* selfemp numIntWeekJobs wksWorkLastYr voter

. 
end of do-file

. 
. * Variables to keep:
. keep ${keeperdemog} ${keeperschool} ${keeperwork}

. 
. 
. * Save attrition rates to external data set
. preserve

.     collapse missInt if year>=1979 & !oversamplePoor & !oversampleMilitary, b
> y(year)

.     gen round = _n

.     l

     +-------------------------+
     | year    missInt   round |
     |-------------------------|
  1. | 1979          0       1 |
  2. | 1980   .0404589       2 |
  3. | 1981   .0345181       3 |
  4. | 1982   .0419953       4 |
  5. | 1983   .0363618       5 |
     |-------------------------|
  6. | 1984   .0470142       6 |
  7. | 1985    .060125       7 |
  8. | 1986   .0810202       8 |
  9. | 1987   .0963843       9 |
 10. | 1988   .0985353      10 |
     |-------------------------|
 11. | 1989   .0865513      11 |
 12. | 1990   .1017105      12 |
 13. | 1991   .0948479      13 |
 14. | 1992   .0952576      14 |
 15. | 1993   .0955649      15 |
     |-------------------------|
 16. | 1994   .1075489      16 |
 17. | 1996   .1333607      17 |
 18. | 1998    .157636      18 |
 19. | 2000   .1938953      19 |
 20. | 2002   .2249309      20 |
     |-------------------------|
 21. | 2004   .2313838      21 |
 22. | 2006   .2326129      22 |
 23. | 2008   .2219605      23 |
 24. | 2010    .241012      24 |
 25. | 2012   .2672334      25 |
     +-------------------------+

.     save y79attritionByCalYr, replace
file y79attritionByCalYr.dta saved

. restore

. 
. preserve

.     collapse missIntEverBefore if year>=1979 & !oversamplePoor & !oversampleM
> ilitary, by(year)

.     gen round = _n

.     l

     +-------------------------+
     | year   missIn~e   round |
     |-------------------------|
  1. | 1979          0       1 |
  2. | 1980   .0404589       2 |
  3. | 1981   .0571546       3 |
  4. | 1982   .0730308       4 |
  5. | 1983   .0834784       5 |
     |-------------------------|
  6. | 1984   .1015057       6 |
  7. | 1985   .1233227       7 |
  8. | 1986   .1482126       8 |
  9. | 1987   .1750486       9 |
 10. | 1988   .1991191      10 |
     |-------------------------|
 11. | 1989   .2123323      11 |
 12. | 1990   .2302571      12 |
 13. | 1991   .2423435      13 |
 14. | 1992   .2549421      14 |
 15. | 1993   .2652873      15 |
     |-------------------------|
 16. | 1994   .2792175      16 |
 17. | 1996   .3010345      17 |
 18. | 1998   .3283827      18 |
 19. | 2000   .3638226      19 |
 20. | 2002   .3948582      20 |
     |-------------------------|
 21. | 2004   .4221039      21 |
 22. | 2006   .4421797      22 |
 23. | 2008   .4552904      23 |
 24. | 2010   .4749565      24 |
 25. | 2012   .4945201      25 |
     +-------------------------+

.     save y79cumAttritionByCalYr, replace
file y79cumAttritionByCalYr.dta saved

. restore

. 
. preserve

.     collapse missInt if year>=1979 & inlist(age,29,30) & !oversamplePoor & !o
> versampleMilitary, by(birthyr)

.     gen round = _n

.     l

     +----------------------------+
     | birthyr    missInt   round |
     |----------------------------|
  1. |    1957   .1189296       1 |
  2. |    1958   .1112158       2 |
  3. |    1959   .1071745       3 |
  4. |    1960   .0921851       4 |
  5. |    1961   .0931085       5 |
     |----------------------------|
  6. |    1962   .0852113       6 |
  7. |    1963   .1001473       7 |
  8. |    1964    .076087       8 |
     +----------------------------+

.     save y79attritionAge2930ByBirthYr, replace
file y79attritionAge2930ByBirthYr.dta saved

. restore

. 
. preserve

.     collapse missIntEverBefore if year>=1979 & inlist(age,29,30) & !oversampl
> ePoor & !oversampleMilitary, by(birthyr)

.     gen round = _n

.     l

     +----------------------------+
     | birthyr   missIn~e   round |
     |----------------------------|
  1. |    1957   .2239841       1 |
  2. |    1958   .2313855       2 |
  3. |    1959   .2431355       3 |
  4. |    1960   .2553111       4 |
  5. |    1961   .2437683       5 |
     |----------------------------|
  6. |    1962   .2415493       6 |
  7. |    1963   .2650957       7 |
  8. |    1964   .2327899       8 |
     +----------------------------+

.     save y79cumAttritionAge2930ByBirthYr, replace
file y79cumAttritionAge2930ByBirthYr.dta saved

. restore

. 
. l id year missInt yearMissInt yrFirstMissInt yrFirstMissIntFull missIntEverBe
> fore if id<=10, sepby(id)

        +-----------------------------------------------------------------+
        | id   year   missInt   yearMi~t   yrFirs~t   yrFirs~l   missIn~e |
        |-----------------------------------------------------------------|
     1. |  1   1970         0          0          .       1980          0 |
     2. |  1   1971         0          0          .       1980          0 |
     3. |  1   1972         0          0          .       1980          0 |
     4. |  1   1973         0          0          .       1980          0 |
     5. |  1   1974         0          0          .       1980          0 |
     6. |  1   1975         0          0          .       1980          0 |
     7. |  1   1976         0          0          .       1980          0 |
     8. |  1   1977         0          0          .       1980          0 |
     9. |  1   1978         0          0          .       1980          0 |
    10. |  1   1979         0          0          .       1980          0 |
    11. |  1   1980         1       1980       1980       1980          1 |
    12. |  1   1981         0          0          .       1980          1 |
    13. |  1   1982         1       1982       1980       1980          1 |
    14. |  1   1983         1       1983       1980       1980          1 |
    15. |  1   1984         1       1984       1980       1980          1 |
    16. |  1   1985         1       1985       1980       1980          1 |
    17. |  1   1986         1       1986       1980       1980          1 |
    18. |  1   1987         1       1987       1980       1980          1 |
    19. |  1   1988         1       1988       1980       1980          1 |
    20. |  1   1989         1       1989       1980       1980          1 |
    21. |  1   1990         1       1990       1980       1980          1 |
    22. |  1   1991         1       1991       1980       1980          1 |
    23. |  1   1992         1       1992       1980       1980          1 |
    24. |  1   1993         1       1993       1980       1980          1 |
    25. |  1   1994         1       1994       1980       1980          1 |
    26. |  1   1996         1       1996       1980       1980          1 |
    27. |  1   1998         1       1998       1980       1980          1 |
    28. |  1   2000         1       2000       1980       1980          1 |
    29. |  1   2002         1       2002       1980       1980          1 |
    30. |  1   2004         1       2004       1980       1980          1 |
    31. |  1   2006         1       2006       1980       1980          1 |
    32. |  1   2008         1       2008       1980       1980          1 |
    33. |  1   2010         1       2010       1980       1980          1 |
    34. |  1   2012         1       2012       1980       1980          1 |
        |-----------------------------------------------------------------|
    35. |  2   1970         0          0          .          .          0 |
    36. |  2   1971         0          0          .          .          0 |
    37. |  2   1972         0          0          .          .          0 |
    38. |  2   1973         0          0          .          .          0 |
    39. |  2   1974         0          0          .          .          0 |
    40. |  2   1975         0          0          .          .          0 |
    41. |  2   1976         0          0          .          .          0 |
    42. |  2   1977         0          0          .          .          0 |
    43. |  2   1978         0          0          .          .          0 |
    44. |  2   1979         0          0          .          .          0 |
    45. |  2   1980         0          0          .          .          0 |
    46. |  2   1981         0          0          .          .          0 |
    47. |  2   1982         0          0          .          .          0 |
    48. |  2   1983         0          0          .          .          0 |
    49. |  2   1984         0          0          .          .          0 |
    50. |  2   1985         0          0          .          .          0 |
    51. |  2   1986         0          0          .          .          0 |
    52. |  2   1987         0          0          .          .          0 |
    53. |  2   1988         0          0          .          .          0 |
    54. |  2   1989         0          0          .          .          0 |
    55. |  2   1990         0          0          .          .          0 |
    56. |  2   1991         0          0          .          .          0 |
    57. |  2   1992         0          0          .          .          0 |
    58. |  2   1993         0          0          .          .          0 |
    59. |  2   1994         0          0          .          .          0 |
    60. |  2   1996         0          0          .          .          0 |
    61. |  2   1998         0          0          .          .          0 |
    62. |  2   2000         0          0          .          .          0 |
    63. |  2   2002         0          0          .          .          0 |
    64. |  2   2004         0          0          .          .          0 |
    65. |  2   2006         0          0          .          .          0 |
    66. |  2   2008         0          0          .          .          0 |
    67. |  2   2010         0          0          .          .          0 |
    68. |  2   2012         0          0          .          .          0 |
        |-----------------------------------------------------------------|
    69. |  3   1970         0          0          .       1981          0 |
    70. |  3   1971         0          0          .       1981          0 |
    71. |  3   1972         0          0          .       1981          0 |
    72. |  3   1973         0          0          .       1981          0 |
    73. |  3   1974         0          0          .       1981          0 |
    74. |  3   1975         0          0          .       1981          0 |
    75. |  3   1976         0          0          .       1981          0 |
    76. |  3   1977         0          0          .       1981          0 |
    77. |  3   1978         0          0          .       1981          0 |
    78. |  3   1979         0          0          .       1981          0 |
    79. |  3   1980         0          0          .       1981          0 |
    80. |  3   1981         1       1981       1981       1981          1 |
    81. |  3   1982         0          0          .       1981          1 |
    82. |  3   1983         0          0          .       1981          1 |
    83. |  3   1984         0          0          .       1981          1 |
    84. |  3   1985         0          0          .       1981          1 |
    85. |  3   1986         0          0          .       1981          1 |
    86. |  3   1987         0          0          .       1981          1 |
    87. |  3   1988         0          0          .       1981          1 |
    88. |  3   1989         0          0          .       1981          1 |
    89. |  3   1990         0          0          .       1981          1 |
    90. |  3   1991         0          0          .       1981          1 |
    91. |  3   1992         0          0          .       1981          1 |
    92. |  3   1993         0          0          .       1981          1 |
    93. |  3   1994         0          0          .       1981          1 |
    94. |  3   1996         0          0          .       1981          1 |
    95. |  3   1998         0          0          .       1981          1 |
    96. |  3   2000         0          0          .       1981          1 |
    97. |  3   2002         0          0          .       1981          1 |
    98. |  3   2004         1       2004       1981       1981          1 |
    99. |  3   2006         0          0          .       1981          1 |
   100. |  3   2008         0          0          .       1981          1 |
   101. |  3   2010         1       2010       1981       1981          1 |
   102. |  3   2012         0          0          .       1981          1 |
        |-----------------------------------------------------------------|
   103. |  4   1970         0          0          .       1980          0 |
   104. |  4   1971         0          0          .       1980          0 |
   105. |  4   1972         0          0          .       1980          0 |
   106. |  4   1973         0          0          .       1980          0 |
   107. |  4   1974         0          0          .       1980          0 |
   108. |  4   1975         0          0          .       1980          0 |
   109. |  4   1976         0          0          .       1980          0 |
   110. |  4   1977         0          0          .       1980          0 |
   111. |  4   1978         0          0          .       1980          0 |
   112. |  4   1979         0          0          .       1980          0 |
   113. |  4   1980         1       1980       1980       1980          1 |
   114. |  4   1981         0          0          .       1980          1 |
   115. |  4   1982         0          0          .       1980          1 |
   116. |  4   1983         0          0          .       1980          1 |
   117. |  4   1984         0          0          .       1980          1 |
   118. |  4   1985         0          0          .       1980          1 |
   119. |  4   1986         0          0          .       1980          1 |
   120. |  4   1987         0          0          .       1980          1 |
   121. |  4   1988         0          0          .       1980          1 |
   122. |  4   1989         0          0          .       1980          1 |
   123. |  4   1990         0          0          .       1980          1 |
   124. |  4   1991         1       1991       1980       1980          1 |
   125. |  4   1992         0          0          .       1980          1 |
   126. |  4   1993         0          0          .       1980          1 |
   127. |  4   1994         1       1994       1980       1980          1 |
   128. |  4   1996         0          0          .       1980          1 |
   129. |  4   1998         0          0          .       1980          1 |
   130. |  4   2000         1       2000       1980       1980          1 |
   131. |  4   2002         1       2002       1980       1980          1 |
   132. |  4   2004         1       2004       1980       1980          1 |
   133. |  4   2006         1       2006       1980       1980          1 |
   134. |  4   2008         1       2008       1980       1980          1 |
   135. |  4   2010         1       2010       1980       1980          1 |
   136. |  4   2012         1       2012       1980       1980          1 |
        |-----------------------------------------------------------------|
   137. |  5   1970         0          0          .       1985          0 |
   138. |  5   1971         0          0          .       1985          0 |
   139. |  5   1972         0          0          .       1985          0 |
   140. |  5   1973         0          0          .       1985          0 |
   141. |  5   1974         0          0          .       1985          0 |
   142. |  5   1975         0          0          .       1985          0 |
   143. |  5   1976         0          0          .       1985          0 |
   144. |  5   1977         0          0          .       1985          0 |
   145. |  5   1978         0          0          .       1985          0 |
   146. |  5   1979         0          0          .       1985          0 |
   147. |  5   1980         0          0          .       1985          0 |
   148. |  5   1981         0          0          .       1985          0 |
   149. |  5   1982         0          0          .       1985          0 |
   150. |  5   1983         0          0          .       1985          0 |
   151. |  5   1984         0          0          .       1985          0 |
   152. |  5   1985         1       1985       1985       1985          1 |
   153. |  5   1986         0          0          .       1985          1 |
   154. |  5   1987         1       1987       1985       1985          1 |
   155. |  5   1988         0          0          .       1985          1 |
   156. |  5   1989         0          0          .       1985          1 |
   157. |  5   1990         1       1990       1985       1985          1 |
   158. |  5   1991         1       1991       1985       1985          1 |
   159. |  5   1992         1       1992       1985       1985          1 |
   160. |  5   1993         1       1993       1985       1985          1 |
   161. |  5   1994         1       1994       1985       1985          1 |
   162. |  5   1996         1       1996       1985       1985          1 |
   163. |  5   1998         1       1998       1985       1985          1 |
   164. |  5   2000         1       2000       1985       1985          1 |
   165. |  5   2002         1       2002       1985       1985          1 |
   166. |  5   2004         1       2004       1985       1985          1 |
   167. |  5   2006         1       2006       1985       1985          1 |
   168. |  5   2008         1       2008       1985       1985          1 |
   169. |  5   2010         1       2010       1985       1985          1 |
   170. |  5   2012         1       2012       1985       1985          1 |
        |-----------------------------------------------------------------|
   171. |  6   1970         0          0          .       1998          0 |
   172. |  6   1971         0          0          .       1998          0 |
   173. |  6   1972         0          0          .       1998          0 |
   174. |  6   1973         0          0          .       1998          0 |
   175. |  6   1974         0          0          .       1998          0 |
   176. |  6   1975         0          0          .       1998          0 |
   177. |  6   1976         0          0          .       1998          0 |
   178. |  6   1977         0          0          .       1998          0 |
   179. |  6   1978         0          0          .       1998          0 |
   180. |  6   1979         0          0          .       1998          0 |
   181. |  6   1980         0          0          .       1998          0 |
   182. |  6   1981         0          0          .       1998          0 |
   183. |  6   1982         0          0          .       1998          0 |
   184. |  6   1983         0          0          .       1998          0 |
   185. |  6   1984         0          0          .       1998          0 |
   186. |  6   1985         0          0          .       1998          0 |
   187. |  6   1986         0          0          .       1998          0 |
   188. |  6   1987         0          0          .       1998          0 |
   189. |  6   1988         0          0          .       1998          0 |
   190. |  6   1989         0          0          .       1998          0 |
   191. |  6   1990         0          0          .       1998          0 |
   192. |  6   1991         0          0          .       1998          0 |
   193. |  6   1992         0          0          .       1998          0 |
   194. |  6   1993         0          0          .       1998          0 |
   195. |  6   1994         0          0          .       1998          0 |
   196. |  6   1996         0          0          .       1998          0 |
   197. |  6   1998         1       1998       1998       1998          1 |
   198. |  6   2000         0          0          .       1998          1 |
   199. |  6   2002         0          0          .       1998          1 |
   200. |  6   2004         0          0          .       1998          1 |
   201. |  6   2006         0          0          .       1998          1 |
   202. |  6   2008         0          0          .       1998          1 |
   203. |  6   2010         0          0          .       1998          1 |
   204. |  6   2012         0          0          .       1998          1 |
        |-----------------------------------------------------------------|
   205. |  7   1970         0          0          .       2012          0 |
   206. |  7   1971         0          0          .       2012          0 |
   207. |  7   1972         0          0          .       2012          0 |
   208. |  7   1973         0          0          .       2012          0 |
   209. |  7   1974         0          0          .       2012          0 |
   210. |  7   1975         0          0          .       2012          0 |
   211. |  7   1976         0          0          .       2012          0 |
   212. |  7   1977         0          0          .       2012          0 |
   213. |  7   1978         0          0          .       2012          0 |
   214. |  7   1979         0          0          .       2012          0 |
   215. |  7   1980         0          0          .       2012          0 |
   216. |  7   1981         0          0          .       2012          0 |
   217. |  7   1982         0          0          .       2012          0 |
   218. |  7   1983         0          0          .       2012          0 |
   219. |  7   1984         0          0          .       2012          0 |
   220. |  7   1985         0          0          .       2012          0 |
   221. |  7   1986         0          0          .       2012          0 |
   222. |  7   1987         0          0          .       2012          0 |
   223. |  7   1988         0          0          .       2012          0 |
   224. |  7   1989         0          0          .       2012          0 |
   225. |  7   1990         0          0          .       2012          0 |
   226. |  7   1991         0          0          .       2012          0 |
   227. |  7   1992         0          0          .       2012          0 |
   228. |  7   1993         0          0          .       2012          0 |
   229. |  7   1994         0          0          .       2012          0 |
   230. |  7   1996         0          0          .       2012          0 |
   231. |  7   1998         0          0          .       2012          0 |
   232. |  7   2000         0          0          .       2012          0 |
   233. |  7   2002         0          0          .       2012          0 |
   234. |  7   2004         0          0          .       2012          0 |
   235. |  7   2006         0          0          .       2012          0 |
   236. |  7   2008         0          0          .       2012          0 |
   237. |  7   2010         0          0          .       2012          0 |
   238. |  7   2012         1       2012       2012       2012          1 |
        |-----------------------------------------------------------------|
   239. |  8   1970         0          0          .          .          0 |
   240. |  8   1971         0          0          .          .          0 |
   241. |  8   1972         0          0          .          .          0 |
   242. |  8   1973         0          0          .          .          0 |
   243. |  8   1974         0          0          .          .          0 |
   244. |  8   1975         0          0          .          .          0 |
   245. |  8   1976         0          0          .          .          0 |
   246. |  8   1977         0          0          .          .          0 |
   247. |  8   1978         0          0          .          .          0 |
   248. |  8   1979         0          0          .          .          0 |
   249. |  8   1980         0          0          .          .          0 |
   250. |  8   1981         0          0          .          .          0 |
   251. |  8   1982         0          0          .          .          0 |
   252. |  8   1983         0          0          .          .          0 |
   253. |  8   1984         0          0          .          .          0 |
   254. |  8   1985         0          0          .          .          0 |
   255. |  8   1986         0          0          .          .          0 |
   256. |  8   1987         0          0          .          .          0 |
   257. |  8   1988         0          0          .          .          0 |
   258. |  8   1989         0          0          .          .          0 |
   259. |  8   1990         0          0          .          .          0 |
   260. |  8   1991         0          0          .          .          0 |
   261. |  8   1992         0          0          .          .          0 |
   262. |  8   1993         0          0          .          .          0 |
   263. |  8   1994         0          0          .          .          0 |
   264. |  8   1996         0          0          .          .          0 |
   265. |  8   1998         0          0          .          .          0 |
   266. |  8   2000         0          0          .          .          0 |
   267. |  8   2002         0          0          .          .          0 |
   268. |  8   2004         0          0          .          .          0 |
   269. |  8   2006         0          0          .          .          0 |
   270. |  8   2008         0          0          .          .          0 |
   271. |  8   2010         0          0          .          .          0 |
   272. |  8   2012         0          0          .          .          0 |
        |-----------------------------------------------------------------|
   273. |  9   1970         0          0          .          .          0 |
   274. |  9   1971         0          0          .          .          0 |
   275. |  9   1972         0          0          .          .          0 |
   276. |  9   1973         0          0          .          .          0 |
   277. |  9   1974         0          0          .          .          0 |
   278. |  9   1975         0          0          .          .          0 |
   279. |  9   1976         0          0          .          .          0 |
   280. |  9   1977         0          0          .          .          0 |
   281. |  9   1978         0          0          .          .          0 |
   282. |  9   1979         0          0          .          .          0 |
   283. |  9   1980         0          0          .          .          0 |
   284. |  9   1981         0          0          .          .          0 |
   285. |  9   1982         0          0          .          .          0 |
   286. |  9   1983         0          0          .          .          0 |
   287. |  9   1984         0          0          .          .          0 |
   288. |  9   1985         0          0          .          .          0 |
   289. |  9   1986         0          0          .          .          0 |
   290. |  9   1987         0          0          .          .          0 |
   291. |  9   1988         0          0          .          .          0 |
   292. |  9   1989         0          0          .          .          0 |
   293. |  9   1990         0          0          .          .          0 |
   294. |  9   1991         0          0          .          .          0 |
   295. |  9   1992         0          0          .          .          0 |
   296. |  9   1993         0          0          .          .          0 |
   297. |  9   1994         0          0          .          .          0 |
   298. |  9   1996         0          0          .          .          0 |
   299. |  9   1998         0          0          .          .          0 |
   300. |  9   2000         0          0          .          .          0 |
   301. |  9   2002         0          0          .          .          0 |
   302. |  9   2004         0          0          .          .          0 |
   303. |  9   2006         0          0          .          .          0 |
   304. |  9   2008         0          0          .          .          0 |
   305. |  9   2010         0          0          .          .          0 |
   306. |  9   2012         0          0          .          .          0 |
        |-----------------------------------------------------------------|
   307. | 10   1970         0          0          .       1986          0 |
   308. | 10   1971         0          0          .       1986          0 |
   309. | 10   1972         0          0          .       1986          0 |
   310. | 10   1973         0          0          .       1986          0 |
   311. | 10   1974         0          0          .       1986          0 |
   312. | 10   1975         0          0          .       1986          0 |
   313. | 10   1976         0          0          .       1986          0 |
   314. | 10   1977         0          0          .       1986          0 |
   315. | 10   1978         0          0          .       1986          0 |
   316. | 10   1979         0          0          .       1986          0 |
   317. | 10   1980         0          0          .       1986          0 |
   318. | 10   1981         0          0          .       1986          0 |
   319. | 10   1982         0          0          .       1986          0 |
   320. | 10   1983         0          0          .       1986          0 |
   321. | 10   1984         0          0          .       1986          0 |
   322. | 10   1985         0          0          .       1986          0 |
   323. | 10   1986         1       1986       1986       1986          1 |
   324. | 10   1987         1       1987       1986       1986          1 |
   325. | 10   1988         0          0          .       1986          1 |
   326. | 10   1989         1       1989       1986       1986          1 |
   327. | 10   1990         0          0          .       1986          1 |
   328. | 10   1991         0          0          .       1986          1 |
   329. | 10   1992         0          0          .       1986          1 |
   330. | 10   1993         0          0          .       1986          1 |
   331. | 10   1994         0          0          .       1986          1 |
   332. | 10   1996         1       1996       1986       1986          1 |
   333. | 10   1998         1       1998       1986       1986          1 |
   334. | 10   2000         1       2000       1986       1986          1 |
   335. | 10   2002         1       2002       1986       1986          1 |
   336. | 10   2004         1       2004       1986       1986          1 |
   337. | 10   2006         1       2006       1986       1986          1 |
   338. | 10   2008         1       2008       1986       1986          1 |
   339. | 10   2010         1       2010       1986       1986          1 |
   340. | 10   2012         1       2012       1986       1986          1 |
        +-----------------------------------------------------------------+

. 
. xtsum id if year>=1979

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
id       overall |    6343.5   3662.139          1      12686 |     N =  317150
         between |             3662.277          1      12686 |     n =   12686
         within  |                    0     6343.5     6343.5 |     T =      25

. logit missInt i.birthyr afqt female i.race hgcMoth hgcFath liveWithMom14 fema
> leHeadHH14 m_hgcMoth m_hgcFath m_afqt c.age##c.age if year>=1979 & !oversampl
> ePoor & !oversampleMilitary

Iteration 0:   log likelihood = -89982.711  
Iteration 1:   log likelihood = -81841.341  
Iteration 2:   log likelihood = -79654.714  
Iteration 3:   log likelihood =  -79622.77  
Iteration 4:   log likelihood = -79622.753  
Iteration 5:   log likelihood = -79622.753  

Logistic regression                             Number of obs     =    244,075
                                                LR chi2(21)       =   20719.92
                                                Prob > chi2       =     0.0000
Log likelihood = -79622.753                     Pseudo R2         =     0.1151

------------------------------------------------------------------------------
     missInt |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     birthyr |
       1958  |   .1124719   .0271795     4.14   0.000     .0592011    .1657427
       1959  |   .2293939   .0267407     8.58   0.000      .176983    .2818048
       1960  |   .0399122    .026787     1.49   0.136    -.0125893    .0924137
       1961  |    .167315   .0266031     6.29   0.000     .1151739    .2194561
       1962  |    .297087   .0263761    11.26   0.000     .2453908    .3487831
       1963  |   .3292878     .02686    12.26   0.000     .2766431    .3819325
       1964  |   .2834968   .0289711     9.79   0.000     .2267144    .3402791
             |
        afqt |  -.0203142   .0084934    -2.39   0.017    -.0369611   -.0036674
      female |  -.3057632   .0131675   -23.22   0.000    -.3315709   -.2799554
             |
        race |
          2  |  -.0831673   .0180137    -4.62   0.000    -.1184735   -.0478612
          3  |   .1337238   .0193314     6.92   0.000      .095835    .1716125
          4  |   .2970342    .189327     1.57   0.117      -.07404    .6681083
             |
     hgcMoth |    .007352   .0027962     2.63   0.009     .0018716    .0128325
     hgcFath |    .009511   .0023137     4.11   0.000     .0049761    .0140458
liveWithM~14 |  -.1457044   .0247055    -5.90   0.000    -.1941263   -.0972825
femaleHea~14 |   .0663249   .0179709     3.69   0.000     .0311026    .1015472
   m_hgcMoth |   .1177028   .0386597     3.04   0.002     .0419312    .1934744
   m_hgcFath |   .1188819   .0300891     3.95   0.000     .0599084    .1778554
      m_afqt |   1.684992   .0201951    83.44   0.000     1.645411    1.724574
         age |   .2114014   .0053733    39.34   0.000     .2008698    .2219329
             |
 c.age#c.age |  -.0019291   .0000745   -25.91   0.000     -.002075   -.0017831
             |
       _cons |  -7.023477    .101992   -68.86   0.000    -7.223378   -6.823577
------------------------------------------------------------------------------

. logit missInt i.birthyr afqt female i.race hgcMoth hgcFath liveWithMom14 fema
> leHeadHH14 m_hgcMoth m_hgcFath m_afqt c.age##c.age if year>=1979 & !oversampl
> ePoor & !oversampleMilitary & age<=34

Iteration 0:   log likelihood = -41572.437  
Iteration 1:   log likelihood = -41296.368  
Iteration 2:   log likelihood = -37434.804  
Iteration 3:   log likelihood = -37238.649  
Iteration 4:   log likelihood = -37237.291  
Iteration 5:   log likelihood = -37237.291  

Logistic regression                             Number of obs     =    160,837
                                                LR chi2(21)       =    8670.29
                                                Prob > chi2       =     0.0000
Log likelihood = -37237.291                     Pseudo R2         =     0.1043

------------------------------------------------------------------------------
     missInt |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     birthyr |
       1958  |   .0735851   .0446472     1.65   0.099    -.0139218     .161092
       1959  |   .2350189   .0429901     5.47   0.000     .1507597     .319278
       1960  |   .0503667   .0433629     1.16   0.245     -.034623    .1353563
       1961  |   .2000325   .0423981     4.72   0.000     .1169339    .2831312
       1962  |   .3190589   .0425337     7.50   0.000     .2356944    .4024233
       1963  |   .4239151   .0421166    10.07   0.000     .3413681    .5064621
       1964  |   .3525376   .0457358     7.71   0.000     .2628971    .4421782
             |
        afqt |  -.0283531    .013322    -2.13   0.033    -.0544638   -.0022424
      female |  -.2578555   .0202815   -12.71   0.000    -.2976065   -.2181044
             |
        race |
          2  |  -.0317994    .027605    -1.15   0.249    -.0859041    .0223054
          3  |   .1720074   .0293598     5.86   0.000     .1144633    .2295516
          4  |   .2355468   .3031849     0.78   0.437    -.3586847    .8297783
             |
     hgcMoth |   .0126371   .0042793     2.95   0.003     .0042499    .0210243
     hgcFath |   .0029052   .0035478     0.82   0.413    -.0040484    .0098589
liveWithM~14 |  -.1916128   .0368651    -5.20   0.000    -.2638671   -.1193584
femaleHea~14 |   .1356483   .0270244     5.02   0.000     .0826814    .1886152
   m_hgcMoth |   .1300327    .058949     2.21   0.027     .0144949    .2455705
   m_hgcFath |   .0122492   .0459811     0.27   0.790     -.077872    .1023705
      m_afqt |   2.083821   .0262573    79.36   0.000     2.032358    2.135285
         age |   .5156335    .024139    21.36   0.000     .4683219     .562945
             |
 c.age#c.age |  -.0078139   .0004576   -17.08   0.000    -.0087109    -.006917
             |
       _cons |  -10.92142   .3209727   -34.03   0.000    -11.55052   -10.29233
------------------------------------------------------------------------------

. tab year if !oversamplePoor & !oversampleMilitary, sum(missInt)

            |   Summary of MISSED INTERVIEW IN
            |            CURRENT YEAR
       YEAR |        Mean   Std. Dev.       Freq.
------------+------------------------------------
       1970 |           0           0       9,763
       1971 |           0           0       9,763
       1972 |           0           0       9,763
       1973 |           0           0       9,763
       1974 |           0           0       9,763
       1975 |           0           0       9,763
       1976 |           0           0       9,763
       1977 |           0           0       9,763
       1978 |           0           0       9,763
       1979 |           0           0       9,763
       1980 |   .04045888   .19704297       9,763
       1981 |   .03451808   .18256504       9,763
       1982 |   .04199529   .20058865       9,763
       1983 |   .03636177   .18719825       9,763
       1984 |   .04701424   .21168016       9,763
       1985 |   .06012496   .23773039       9,763
       1986 |   .08102018   .27288008       9,763
       1987 |   .09638431   .29513267       9,763
       1988 |   .09853529   .29805232       9,763
       1989 |   .08655126   .28119076       9,763
       1990 |   .10171054   .30228276       9,763
       1991 |    .0948479   .29301974       9,763
       1992 |   .09525761   .29358546       9,763
       1993 |   .09556489   .29400866       9,763
       1994 |   .10754891   .30982571       9,763
       1996 |   .13336065   .33998151       9,763
       1998 |   .15763597     .364418       9,763
       2000 |   .19389532    .3953681       9,763
       2002 |   .22493086   .41755817       9,763
       2004 |    .2313838   .42173873       9,763
       2006 |   .23261293   .42251916       9,763
       2008 |   .22196046   .41558598       9,763
       2010 |   .24101198   .42771947       9,763
       2012 |   .26723343   .44253789       9,763
------------+------------------------------------
      Total |   .08887999   .28457087     331,942

. tab year if !oversamplePoor & !oversampleMilitary, sum(missIntEverBefore)

            |    Summary of missIntEverBefore
       YEAR |        Mean   Std. Dev.       Freq.
------------+------------------------------------
       1970 |           0           0       9,763
       1971 |           0           0       9,763
       1972 |           0           0       9,763
       1973 |           0           0       9,763
       1974 |           0           0       9,763
       1975 |           0           0       9,763
       1976 |           0           0       9,763
       1977 |           0           0       9,763
       1978 |           0           0       9,763
       1979 |           0           0       9,763
       1980 |   .04045888   .19704297       9,763
       1981 |   .05715456   .23214961       9,763
       1982 |   .07303083   .26020043       9,763
       1983 |   .08347844    .2766182       9,763
       1984 |   .10150568   .30201262       9,763
       1985 |   .12332275   .32882415       9,763
       1986 |   .14821264   .35532884       9,763
       1987 |   .17504865   .38002818       9,763
       1988 |   .19911912   .39935828       9,763
       1989 |   .21233227   .40897972       9,763
       1990 |   .23025709   .42101891       9,763
       1991 |   .24234354     .428523       9,763
       1992 |   .25494213     .435851       9,763
       1993 |   .26528731   .44150869       9,763
       1994 |   .27921745   .44863759       9,763
       1996 |   .30103452   .45873118       9,763
       1998 |   .32838267   .46964889       9,763
       2000 |    .3638226   .48112309       9,763
       2002 |   .39485814   .48884524       9,763
       2004 |   .42210386   .49392022       9,763
       2006 |   .44217966   .49667099       9,763
       2008 |   .45529038   .49802254       9,763
       2010 |   .47495647     .499398       9,763
       2012 |   .49452013   .49999558       9,763
------------+------------------------------------
      Total |   .18126058   .38523451     331,942

. tab birthyr if inlist(age,29,30) & !oversamplePoor & !oversampleMilitary, sum
> (missInt)

            |   Summary of MISSED INTERVIEW IN
    Year of |            CURRENT YEAR
      birth |        Mean   Std. Dev.       Freq.
------------+------------------------------------
       1957 |   .11892963   .32378593       2,018
       1958 |   .11121583   .31447333       2,122
       1959 |   .10717449   .30940348       2,258
       1960 |   .09218513     .289342       2,636
       1961 |    .0931085    .2906377       2,728
       1962 |   .08521127   .27924499       2,840
       1963 |   .10014728   .30025155       2,716
       1964 |   .07608696   .26525736       1,104
------------+------------------------------------
      Total |   .09841494   .29788296      18,422

. drop if missInt
(73,509 observations deleted)

. xtsum id if year>=1979 & !missInt

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
id       overall |  5773.055   3493.034          1      12686 |     N =  243641
         between |             3662.277          1      12686 |     n =   12686
         within  |                    0   5773.055   5773.055 | T-bar = 19.2055

. 
. * drop the two oversamples that other papers typically ignore
. drop if oversamplePoor | oversampleMilitary
(55,376 observations deleted)

. 
. xtsum id if year>=1979

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
id       overall |  5192.963   3255.092          1      12686 |     N =  214572
         between |             3266.123          1      12686 |     n =    9763
         within  |                    0   5192.963   5192.963 | T-bar = 21.9781

. xtsum id if year>=1979 & female

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
id       overall |  5173.999   3240.692          1      12558 |     N =  110196
         between |             3254.006          1      12558 |     n =    4926
         within  |                    0   5173.999   5173.999 | T-bar = 22.3703

. xtsum id if year>=1979 & !female

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
id       overall |  5212.985   3270.122          5      12686 |     N =  104376
         between |             3278.601          5      12686 |     n =    4837
         within  |                    0   5212.985   5212.985 | T-bar = 21.5787

. 
. xtsum id if year>=1979 & !mi(hgc)

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
id       overall |  5192.124   3255.338          1      12686 |     N =  214306
         between |             3266.123          1      12686 |     n =    9763
         within  |                    0   5192.124   5192.124 | T-bar = 21.9508

. xtsum id if year>=1979 & !mi(hgc) & female

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
id       overall |  5173.645   3241.202          1      12558 |     N =  110076
         between |             3254.006          1      12558 |     n =    4926
         within  |                    0   5173.645   5173.645 | T-bar = 22.3459

. xtsum id if year>=1979 & !mi(hgc) & !female

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
id       overall |   5211.64   3270.102          5      12686 |     N =  104230
         between |             3278.601          5      12686 |     n =    4837
         within  |                    0    5211.64    5211.64 | T-bar = 21.5485

. 
. xtsum id if year>=1979 & !mi(hgc) & age==25

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
id       overall |  5185.216   3250.993          2      12686 |     N =    8979
         between |             3250.993          2      12686 |     n =    8979
         within  |                    0   5185.216   5185.216 |     T =       1

. xtsum id if year>=1979 & !mi(hgc) & age==25 & female

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
id       overall |  5171.652   3237.704          2      12558 |     N =    4604
         between |             3237.704          2      12558 |     n =    4604
         within  |                    0   5171.652   5171.652 |     T =       1

. xtsum id if year>=1979 & !mi(hgc) & age==25 & !female

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
id       overall |   5199.49   3265.229          6      12686 |     N =    4375
         between |             3265.229          6      12686 |     n =    4375
         within  |                    0    5199.49    5199.49 |     T =       1

. 
. drop if year<=1978
(87,867 observations deleted)

. 
. compress
  variable wage25 was float now int
  variable wage26 was float now int
  variable svyRound was float now byte
  variable age was float now byte
  variable birthq was float now byte
  variable birthmo was float now byte
  variable birthyr was float now int
  variable m_hgcMoth was float now byte
  variable m_hgcFath was float now byte
  variable m_afqt was float now byte
  variable m_asvabAR was float now byte
  variable m_asvabCS was float now byte
  variable m_asvabMK was float now byte
  variable m_asvabNO was float now byte
  variable m_asvabPC was float now byte
  variable m_asvabWK was float now byte
  variable foreignBorn was float now byte
  variable black was float now byte
  variable hispanic was float now byte
  variable white was float now byte
  variable asian was float now byte
  variable race was float now byte
  variable female was float now byte
  variable born1957 was float now byte
  variable born1958 was float now byte
  variable born1959 was float now byte
  variable born1960 was float now byte
  variable born1961 was float now byte
  variable born1962 was float now byte
  variable born1963 was float now byte
  variable born1964 was float now byte
  variable liveWithMom14 was float now byte
  variable femaleHeadHH14 was float now byte
  variable oversampleRace was float now byte
  variable oversamplePoor was float now byte
  variable oversampleMilitary was float now byte
  variable m_famIncAsTeen was float now byte
  variable missInt was float now byte
  variable everMissInt was float now byte
  variable ageAtMissInt was float now byte
  variable yearMissInt was float now byte
  variable yrFirstMissInt was float now byte
  variable yrFirstMissIntFull was float now int
  variable missIntEverBefore was float now byte
  variable missIntCum was float now byte
  variable missIntLength was float now byte
  variable missIntLastSpell was float now byte
  variable missIntEnd was float now byte
  variable missIntEndLength was float now byte
  variable missIntFirstYear was float now byte
  variable missIntLongestSpellYet was float now byte
  variable missIntInvalidPeriod was float now byte
  variable lastValidInt was float now byte
  variable lastValidIntDate was float now int
  variable ever_miss_1_int was float now byte
  variable ever_miss_2_int was float now byte
  variable ever_miss_3_int was float now byte
  variable ever_miss_4_int was float now byte
  variable ever_miss_5_int was float now byte
  variable ever_miss_6_int was float now byte
  variable ever_miss_7_int was float now byte
  variable ever_miss_8_int was float now byte
  variable ever_miss_9_int was float now byte
  variable ever_miss_10_int was float now byte
  variable ever_miss_11_int was float now byte
  variable everMiss3plusInt was float now byte
  variable ever_return_after_1_miss_int was float now byte
  variable ever_return_after_2_miss_int was float now byte
  variable ever_return_after_3_miss_int was float now byte
  variable ever_return_after_4_miss_int was float now byte
  variable ever_return_after_5_miss_int was float now byte
  variable ever_return_after_6_miss_int was float now byte
  variable ever_return_after_7_miss_int was float now byte
  variable ever_return_after_8_miss_int was float now byte
  variable ever_return_after_9_miss_int was float now byte
  variable ever_return_after_10_miss_int was float now byte
  variable ever_return_after_11_miss_int was float now byte
  variable everReturnAfter3plusMissInt was float now byte
  variable hgc was float now byte
  variable grad4yr was float now byte
  variable gradGrad was float now byte
  variable ged was float now byte
  variable gradHS was float now byte
  variable enrolled was float now byte
  variable numIntWeekJobs was float now byte
  variable hours was float now int
  variable occ was float now int
  variable ind was float now int
  variable class was float now byte
  variable selfemp was float now byte
  variable empFT was float now byte
  variable empPT was float now byte
  variable voter was float now byte
  (58,149,012 bytes saved)

. save master, replace
(note: file master.dta not found)
file master.dta saved

. !gzip -f master.dta


. log close
      name:  <unnamed>
       log:  /home/data/ransom/NLSYvCPS/Data/NLSY/y79/create_master.log
  log type:  text
 closed on:  11 Feb 2019, 11:56:22
-------------------------------------------------------------------------------
