------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/jared/NLSYvCPS/Data/SIPP/sipp_jared.log
  log type:  text
 opened on:   6 Jul 2018, 10:32:20

. 
. /* This file follows sipp_96to08_master_readin.do */
. /* This file combines the SIPP files and transforms them into person-record format so we can use them, then combines all the years */
. /* Some notes:
> SIPP notes:
> 
> For 1996, it looks like there are 12 files, with each file having a trimester of the year, ie months 1-4, 5-8 or 9-12
> In each month, we have info on wksem (across all jobs), wage1 (called wage; wage2 was ignored for some reason), hoursjob1, earnjob1, hoursjob2, earnjob2, 
> and demographics
> 
> It appears that anyone who was enrolled was not allowed to have earnings
> `replace earnings_annual1996 = earnings_annual1996 + earnings_job1_month`k' + earnings_job2_month`k' if enrl_m`k' == 0 & rot == 1`
> `replace earnings_annual1996 = (earnings_annual1996/(months_seen1996-months_enrolled1996)) * 12  if rot == 1`
> `replace earnings_annual1996 = 0 if months_enrolled1996 == months_seen1996 & rot == 1`
> 
> 
> Some pid's may not be uniquely identifying obs
> */
. 
. /* Interview date Roadmap: 
> 1996: k - 1-12
> 2001: k - 1-9
> 2004: k - 1-12
> 2008: k - 1-16
> 
> * Rotation group 1: 1996 is months 2-13, 1997 is months 14-25, 1998 is 26-37, 1999 is 38-48 
> * Rotation group 2: 1996 is months 1-12, 1997 is months 13-24, 1998 is 25-36, 1999 is 37-48 
> * Rotation group 3: 1996 is months 1-11, 1997 is months 12-23, 1998 is 24-35, 1999 is 36-47 
> * Rotation group 4: 1996 is months 1-10, 1997 is months 11-22, 1998 is 22-34, 1999 is 35-46 
> * Rotation group 1: 2001 is months 2-13, 2002 is months 14-25, 2003 is 26-37, 2004 is 38-48 
> * Rotation group 2: 2001 is months 1-12, 2002 is months 13-24, 2003 is 25-36, 2004 is 37-48 
> * Rotation group 3: 2001 is months 1-11, 2002 is months 12-23, 2003 is 24-35, 2004 is 36-47 
> * Rotation group 4: 2001 is months 1-10, 2002 is months 11-22, 2003 is 22-34, 2004 is 35-46 
> * Rotation group 1: 2004 is months 2-13, 2005 is months 14-25, 2006 is 26-37, 2007 is 38-48 
> * Rotation group 2: 2004 is months 1-12, 2005 is months 13-24, 2006 is 25-36, 2007 is 37-48 
> * Rotation group 3: 2004 is months 1-11, 2005 is months 12-23, 2006 is 24-35, 2007 is 36-47 
> * Rotation group 4: 2004 is months 1-10, 2005 is months 11-22, 2006 is 22-34, 2007 is 35-46 
> * Rotation group 1: 2008 is months 2-13, 2009 is months 14-25, 2010 is 26-37, 2011 is 38-48 
> * Rotation group 2: 2008 is months 1-12, 2009 is months 13-24, 2010 is 25-36, 2011 is 37-48 
> * Rotation group 3: 2008 is months 1-11, 2009 is months 12-23, 2010 is 24-35, 2011 is 36-47 
> * Rotation group 4: 2008 is months 1-10, 2009 is months 11-22, 2010 is 22-34, 2011 is 35-46 
> 
> * I belive the above is slightly off; best ot try to convert values into months;
> 
> From what I can tell from the user's guide, the 96 went like this:
> Rot 1: Dec. 95-Nov. 99 (48 months)
> Rot 2: Jan. 96-Dec. 99 (48 months)
> Rot 3: Feb. 96-Jan. 00 (48 months)
> Rot 4: Mar. 96-Feb. 00 (48 months)
>   ------10 months skipped
> 2001 went like this:
> Rot 1: Oct. 00-Sep. 03 (36 months)
> Rot 2: Nov. 00-Oct. 03 (36 months)
> Rot 3: Dec. 00-Nov. 03 (36 months)
> Rot 4: Jan. 01-Dec. 03 (36 months)
> 
> 2004 went like this:
> Rot 1: Oct. 03-Sep. 07 (48 months)
> Rot 2: Nov. 03-Oct. 07 (48 months)
> Rot 3: Dec. 03-Nov. 07 (48 months)
> Rot 4: Jan. 04-Dec. 07 (48 months)
> 
> 2008 went like this (we may have more data then the online file refers to)
> Rot 1: May. 08-Aug. 12 (52 months) 64?
> Rot 2: Jun. 08-Sep. 12 (52 months)
> Rot 3: Jul. 08-Oct. 12 (52 months)
> Rot 4: Aug. 08-Nov. 12 (52 months)
> 
> https://www2.census.gov/programs-surveys/sipp/guidance/SIPP_2008_USERS_Guide_Chapter2.pdf, Tables 2.2-5
> 
> */
. 
. foreach X in 96 01 04 08 {
  2.         use Temp/sipp`X'_full, clear
  3.         * For whatever reason, pid is garbage
.         drop pid
  4.         isid ssuid eentaid epppnum
  5.         egen pid = group(ssuid eentaid epppnum)
  6.         gen  pidsvy = pid*100+`X'
  7.         set seed 101
  8.         * Sampler: comment out for full code
.         sample 10
  9.         
.         reshape long state weight age enrl_m wksem_month hours_job1_month earnings_job1_month wage_month ind1_month occ1_month hours_job2_month earnings_j
> ob2_month male hispanic black, i(ssuid rot eentaid epppnum tbyear pid pidsvy) j(sippmonth)
 10.         gen svy = `X'
 11. 
.         tempfile holder`X'
 12.         save `holder`X''
 13. }
(104,399 observations deleted)
(note: j = 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                    11600   ->  556800
Number of variables                 727   ->      23
j variable (48 values)                    ->   sippmonth
xij variables:
              state1 state2 ... state48   ->   state
           weight1 weight2 ... weight48   ->   weight
                    age1 age2 ... age48   ->   age
           enrl_m1 enrl_m2 ... enrl_m48   ->   enrl_m
wksem_month1 wksem_month2 ... wksem_month48->  wksem_month
hours_job1_month1 hours_job1_month2 ... hours_job1_month48->hours_job1_month
earnings_job1_month1 earnings_job1_month2 ... earnings_job1_month48->earnings_job1_month
wage_month1 wage_month2 ... wage_month48  ->   wage_month
ind1_month1 ind1_month2 ... ind1_month48  ->   ind1_month
occ1_month1 occ1_month2 ... occ1_month48  ->   occ1_month
hours_job2_month1 hours_job2_month2 ... hours_job2_month48->hours_job2_month
earnings_job2_month1 earnings_job2_month2 ... earnings_job2_month48->earnings_job2_month
                 male1 male2 ... male48   ->   male
     hispanic1 hispanic2 ... hispanic48   ->   hispanic
              black1 black2 ... black48   ->   black
-----------------------------------------------------------------------------
file /tmp/St18120.000001 saved
(93,649 observations deleted)
(note: j = 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                    10405   ->  374580
Number of variables                 547   ->      23
j variable (36 values)                    ->   sippmonth
xij variables:
              state1 state2 ... state36   ->   state
           weight1 weight2 ... weight36   ->   weight
                    age1 age2 ... age36   ->   age
           enrl_m1 enrl_m2 ... enrl_m36   ->   enrl_m
wksem_month1 wksem_month2 ... wksem_month36->  wksem_month
hours_job1_month1 hours_job1_month2 ... hours_job1_month36->hours_job1_month
earnings_job1_month1 earnings_job1_month2 ... earnings_job1_month36->earnings_job1_month
wage_month1 wage_month2 ... wage_month36  ->   wage_month
ind1_month1 ind1_month2 ... ind1_month36  ->   ind1_month
occ1_month1 occ1_month2 ... occ1_month36  ->   occ1_month
hours_job2_month1 hours_job2_month2 ... hours_job2_month36->hours_job2_month
earnings_job2_month1 earnings_job2_month2 ... earnings_job2_month36->earnings_job2_month
                 male1 male2 ... male36   ->   male
     hispanic1 hispanic2 ... hispanic36   ->   hispanic
              black1 black2 ... black36   ->   black
-----------------------------------------------------------------------------
file /tmp/St18120.000002 saved
(118,427 observations deleted)
(note: j = 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                    13159   ->  631632
Number of variables                 727   ->      23
j variable (48 values)                    ->   sippmonth
xij variables:
              state1 state2 ... state48   ->   state
           weight1 weight2 ... weight48   ->   weight
                    age1 age2 ... age48   ->   age
           enrl_m1 enrl_m2 ... enrl_m48   ->   enrl_m
wksem_month1 wksem_month2 ... wksem_month48->  wksem_month
hours_job1_month1 hours_job1_month2 ... hours_job1_month48->hours_job1_month
earnings_job1_month1 earnings_job1_month2 ... earnings_job1_month48->earnings_job1_month
wage_month1 wage_month2 ... wage_month48  ->   wage_month
ind1_month1 ind1_month2 ... ind1_month48  ->   ind1_month
occ1_month1 occ1_month2 ... occ1_month48  ->   occ1_month
hours_job2_month1 hours_job2_month2 ... hours_job2_month48->hours_job2_month
earnings_job2_month1 earnings_job2_month2 ... earnings_job2_month48->earnings_job2_month
                 male1 male2 ... male48   ->   male
     hispanic1 hispanic2 ... hispanic48   ->   hispanic
              black1 black2 ... black48   ->   black
-----------------------------------------------------------------------------
file /tmp/St18120.000003 saved
(118,732 observations deleted)
(note: j = 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 5
> 2 53 54 55 56 57 58 59 60 61 62 63 64)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                    13192   ->  844288
Number of variables                 967   ->      23
j variable (64 values)                    ->   sippmonth
xij variables:
              state1 state2 ... state64   ->   state
           weight1 weight2 ... weight64   ->   weight
                    age1 age2 ... age64   ->   age
           enrl_m1 enrl_m2 ... enrl_m64   ->   enrl_m
wksem_month1 wksem_month2 ... wksem_month64->  wksem_month
hours_job1_month1 hours_job1_month2 ... hours_job1_month64->hours_job1_month
earnings_job1_month1 earnings_job1_month2 ... earnings_job1_month64->earnings_job1_month
wage_month1 wage_month2 ... wage_month64  ->   wage_month
ind1_month1 ind1_month2 ... ind1_month64  ->   ind1_month
occ1_month1 occ1_month2 ... occ1_month64  ->   occ1_month
hours_job2_month1 hours_job2_month2 ... hours_job2_month64->hours_job2_month
earnings_job2_month1 earnings_job2_month2 ... earnings_job2_month64->earnings_job2_month
                 male1 male2 ... male64   ->   male
     hispanic1 hispanic2 ... hispanic64   ->   hispanic
              black1 black2 ... black64   ->   black
-----------------------------------------------------------------------------
file /tmp/St18120.000004 saved

. clear

. foreach X in 96 01 04 08 {
  2.         append using `holder`X''
  3. }
(label tpmsum2l already defined)
(label ejbhrs2l already defined)
(label tjbocc1l already defined)
(label ejbind1l already defined)
(label tpyratem already defined)
(label tpmsum1l already defined)
(label ejbhrs1l already defined)
(label rmwkwjb already defined)
(label eenrlm already defined)
(label tage already defined)
(label wpfinwgt already defined)
(label tfipsst already defined)
(label tpmsum2l already defined)
(label ejbhrs2l already defined)
(label tjbocc1l already defined)
(label ejbind1l already defined)
(label tpyratem already defined)
(label tpmsum1l already defined)
(label ejbhrs1l already defined)
(label rmwkwjb already defined)
(label eenrlm already defined)
(label tage already defined)
(label wpfinwgt already defined)
(label tfipsst already defined)
(label tpmsum2l already defined)
(label ejbhrs2l already defined)
(label tjbocc1l already defined)
(label ejbind1l already defined)
(label tpyratem already defined)
(label tpmsum1l already defined)
(label ejbhrs1l already defined)
(label rmwkwjb already defined)
(label eenrlm already defined)
(label tage already defined)
(label tfipsst already defined)

. isid pid svy sippmonth

. isid pidsvy sippmonth

. 
. * Convert sippmonth into year-month; 
. gen     date0 = .
(2,407,300 missing values generated)

. format  date0 %td

. 
. replace date0 = mdy(11,1,1995) if rot==1 & svy==96
(141,024 real changes made)

. replace date0 = mdy(12,1,1995) if rot==2 & svy==96
(137,520 real changes made)

. replace date0 = mdy( 1,1,1996) if rot==3 & svy==96
(137,952 real changes made)

. replace date0 = mdy( 2,1,1996) if rot==4 & svy==96
(140,304 real changes made)

. 
. replace date0 = mdy( 9,1,2000) if rot==1 & svy==01
(91,944 real changes made)

. replace date0 = mdy(10,1,2000) if rot==2 & svy==01
(93,780 real changes made)

. replace date0 = mdy(11,1,2000) if rot==3 & svy==01
(95,544 real changes made)

. replace date0 = mdy(12,1,2000) if rot==4 & svy==01
(93,312 real changes made)

. 
. replace date0 = mdy( 9,1,2003) if rot==1 & svy==04
(151,920 real changes made)

. replace date0 = mdy(10,1,2003) if rot==2 & svy==04
(158,592 real changes made)

. replace date0 = mdy(11,1,2003) if rot==3 & svy==04
(163,248 real changes made)

. replace date0 = mdy(12,1,2003) if rot==4 & svy==04
(157,872 real changes made)

. 
. replace date0 = mdy( 4,1,2008) if rot==1 & svy==08
(204,608 real changes made)

. replace date0 = mdy( 5,1,2008) if rot==2 & svy==08
(220,544 real changes made)

. replace date0 = mdy( 6,1,2008) if rot==3 & svy==08
(208,192 real changes made)

. replace date0 = mdy( 7,1,2008) if rot==4 & svy==08
(210,944 real changes made)

. assert ~mi(date0)

. 
. gen     month0Stata = mofd(date0)

. gen     monthStata = month0Stata+sippmonth

. gen     month = month(dofm(monthStata))

. gen     year  = year(dofm(monthStata))

. format  month0Stata monthStata %tm

. l pid svy sippmonth date0-year if mod(pid,20000)==0 & mod(sippmonth,12)==0, sepby(pid)

         +--------------------------------------------------------------------------+
         |    pid   svy   sippmo~h       date0   month0~a   monthS~a   month   year |
         |--------------------------------------------------------------------------|
1508496. | 120000     4         12   01sep2003     2003m9     2004m9       9   2004 |
1508508. | 120000     4         24   01sep2003     2003m9     2005m9       9   2005 |
1508520. | 120000     4         36   01sep2003     2003m9     2006m9       9   2006 |
1508532. | 120000     4         48   01sep2003     2003m9     2007m9       9   2007 |
         +--------------------------------------------------------------------------+

. 
. drop date0 month0Stata monthStata

. 
. * And now we can reshape it back, or just create annual vars using 'by' and then keep _n==1
. * So, we need to create variables that do not vary within year
. 
. 
. * Missing data comes from the reshape, nothing more,
. * Drop all missing obs
. drop if mi(weight)
(840,373 observations deleted)

. 
. sort pidsvy year month

. by pidsvy year: gen firstObs = _n==1

. by pidsvy year: gen numObs = _N

. 
. ren tbyear birthyr

. * We do have age in each month if we want it
. ren age ageinterview

. gen age = year-birthyr

. 
. corr age ageinterview
(obs=1,566,927)

             |      age ageint~w
-------------+------------------
         age |   1.0000
ageinterview |   0.9982   1.0000


. 
. *****************************************************************************
. * Employment Status/Hours
. *****************************************************************************
. * data has inconsistencies between wksem and hours/earnings/wage_job?_month
. *  in a very small number of instances, wksem==0, but there is job1 info
. *  in a larger number of case (10%?), earnings==NA, but wksem>0
. * replace employed1996 = employed1996 + 1 if wksem_month`k' >= 1 & wksem_month`k' != . & enrl_m`k' == 0 & rot == 1
. 
. gen employed_month = inrange(wksem,1,.) & inrange(hours_job1_month,1,.)

. 
. * How many weeks worked; 
. by  pidsvy year: egen annual_wksem = total(wksem_month)

. gen pct_wksem = annual_wksem/(numObs*4.3)

. 
. * Hours worked/week (potentially use last obs of this?)
. gen     weekly_hours = (0)*(hours_job1_month<0) + (hours_job1_month)*inrange(hours_job1_month,0,.)+ (hours_job2_month)*inrange(hours_job2_month,0,.)

. 
. * Average hours worked/week IF employed
. by  pidsvy year: egen average_weekly_hours     = mean(weekly_hours) if inrange(wksem_month,1,5)
(817174 missing values generated)

. by  pidsvy year: egen average_weekly_hours_max = max(average_weekly_hours)
(734762 missing values generated)

. replace               average_weekly_hours     = max(0,average_weekly_hours_max)
(817,174 real changes made)

. 
. * empFT IF: worked 40+ weeks (>75%) AND worked 35+ hours average in those weeks (too strong?)
. gen empFT = inrange(pct_wksem,0.75,.) & inrange(average_weekly_hours,35,.)

. gen empFT2= inrange(pct_wksem,0.75,.) & inrange(average_weekly_hours,30,.)

. gen empFT3= inrange(pct_wksem,0.60,.) & inrange(average_weekly_hours,35,.)

. 
. tab birthyr age if inrange(age,30,34) & firstObs &  male, sum(empFT) 

            Means, Standard Deviations and Frequencies of empFT

  PE: Year |                        age
  of birth |        30         31         32         33         34 |     Total
-----------+-------------------------------------------------------+----------
      1961 |         .          .          .          .  .77777778 | .77777778
           |         .          .          .          .  .42779263 | .42779263
           |         0          0          0          0         18 |        18
-----------+-------------------------------------------------------+----------
      1962 |         .          .          .       .625  .64102564 |  .6372549
           |         .          .          .  .49453536  .48280455 | .48316645
           |         0          0          0         24         78 |       102
-----------+-------------------------------------------------------+----------
      1963 |         .          .         .8  .73684211    .765625 |    .75625
           |         .          .  .41039134  .44327331  .42695628 | .43069163
           |         0          0         20         76         64 |       160
-----------+-------------------------------------------------------+----------
      1964 |         .         .6  .62903226  .59183673  .66666667 | .62573099
           |         .  .50709255  .48700729  .49658699  .47673129 | .48535483
           |         0         15         62         49         45 |       171
-----------+-------------------------------------------------------+----------
      1965 | .86666667  .72222222  .71641791  .77777778  .79245283 | .75478927
           | .35186578  .45104643  .45413822  .41964345  .40943162 | .43103861
           |        15         72         67         54         53 |       261
-----------+-------------------------------------------------------+----------
      1966 | .80246914  .82894737  .82608696        .75  .80952381 | .80481283
           | .40061681    .379057  .38181154  .43643578  .39503517 | .39687566
           |        81         76         69         64         84 |       374
-----------+-------------------------------------------------------+----------
      1967 | .76119403  .80327869       .875   .8028169  .74193548 | .79288026
           | .42957175  .40081883  .33421868  .40070361  .44114173 | .40589942
           |        67         61         48         71         62 |       309
-----------+-------------------------------------------------------+----------
      1968 | .68627451  .61363636  .78333333  .73076923  .74418605 |      .716
           | .46862335  .49254484   .4154502  .44788762  .44148145 | .45184139
           |        51         44         60         52         43 |       250
-----------+-------------------------------------------------------+----------
      1969 |       .86  .78666667  .74242424  .73584906  .72631579 |  .7640118
           | .35050983   .4124198  .44065008   .4450991  .44821407 | .42524251
           |        50         75         66         53         95 |       339
-----------+-------------------------------------------------------+----------
      1970 | .85882353  .77631579  .80701754   .7421875        .66 | .76008969
           |    .35027  .41948172  .39814734  .43914903  .47609523 | .42750806
           |        85         76         57        128        100 |       446
-----------+-------------------------------------------------------+----------
      1971 | .81818182  .68518519  .70408163   .6056338  .62318841 | .68715084
           | .38865017  .46880314   .4588013  .49219257  .48813719 | .46430242
           |        66         54         98         71         69 |       358
-----------+-------------------------------------------------------+----------
      1972 | .73913043  .70642202  .71276596  .69473684        .75 | .71728972
           | .44396109  .45750435  .45489785  .46296188   .4356134 | .45084375
           |        46        109         94         95         84 |       428
-----------+-------------------------------------------------------+----------
      1973 | .70526316  .55555556  .70491803  .75471698        .64 | .67676768
           | .45834309  .50089526  .45986456  .43437224  .48989795 | .46849997
           |        95         63         61         53         25 |       297
-----------+-------------------------------------------------------+----------
      1974 | .54166667  .64179104        .65        .65  .66666667 | .62222222
           | .50175747  .48309271  .48099473  .48936048  .47609523 | .48573199
           |        72         67         60         20         51 |       270
-----------+-------------------------------------------------------+----------
      1975 | .66197183  .75806452         .8  .73015873  .61428571 |  .6975945
           | .47640505  .43175144  .40824829  .44744252  .49027816 | .46009113
           |        71         62         25         63         70 |       291
-----------+-------------------------------------------------------+----------
      1976 | .72916667  .54166667  .48484848  .53225806   .4137931 | .53100775
           | .44909286  .50897738  .50360009  .50303153   .4968138 | .50000754
           |        48         24         66         62         58 |       258
-----------+-------------------------------------------------------+----------
      1977 | .53571429  .60655738    .609375  .58333333  .52459016 | .57664234
           |  .5078745  .49256771  .49174737  .49716712  .50353939 | .49499514
           |        28         61         64         60         61 |       274
-----------+-------------------------------------------------------+----------
      1978 | .59016393  .42857143  .48275862         .5        .42 |  .4858156
           |  .4958847   .4988466  .50406694  .50507627  .49856938 | .50068729
           |        61         63         58         50         50 |       282
-----------+-------------------------------------------------------+----------
      1979 | .55555556  .65151515        .54  .52941176  .57777778 | .57394366
           | .50039108  .48014178  .50345743  .50410083  .49949469 | .49537502
           |        72         66         50         51         45 |       284
-----------+-------------------------------------------------------+----------
      1980 | .53968254  .58461538  .50819672  .55319149          . | .54661017
           | .50242627  .49662321   .5040817   .5025375          . | .49888082
           |        63         65         61         47          0 |       236
-----------+-------------------------------------------------------+----------
      1981 | .48214286  .47272727  .52173913          .          . | .49044586
           | .50420311  .50385718  .50504699          .          . | .50150842
           |        56         55         46          0          0 |       157
-----------+-------------------------------------------------------+----------
      1982 | .54545455  .56818182          .          .          . | .55555556
           | .50251891  .50105597          .          .          . | .49943278
           |        55         44          0          0          0 |        99
-----------+-------------------------------------------------------+----------
      1983 | .52173913          .          .          .          . | .52173913
           | .50504699          .          .          .          . | .50504699
           |        46          0          0          0          0 |        46
-----------+-------------------------------------------------------+----------
     Total | .67553191  .66493056  .67402827  .67629046  .66493506 | .67110333
           | .46838343  .47221974  .46894395  .46809547  .47221763 |  .4698535
           |      1128       1152       1132       1143       1155 |      5710

. tab birthyr age if inrange(age,30,34) & firstObs & ~male, sum(empFT) 

            Means, Standard Deviations and Frequencies of empFT

  PE: Year |                        age
  of birth |        30         31         32         33         34 |     Total
-----------+-------------------------------------------------------+----------
      1961 |         .          .          .          .  .42857143 | .42857143
           |         .          .          .          .  .50709255 | .50709255
           |         0          0          0          0         21 |        21
-----------+-------------------------------------------------------+----------
      1962 |         .          .          .  .70833333  .52564103 | .56862745
           |         .          .          .  .46430562  .50257413 | .49771366
           |         0          0          0         24         78 |       102
-----------+-------------------------------------------------------+----------
      1963 |         .          .  .43478261  .42857143   .4025974 | .41847826
           |         .          .   .5068698  .49784389  .49363689 | .49465545
           |         0          0         23         84         77 |       184
-----------+-------------------------------------------------------+----------
      1964 |         .  .38461538  .46153846  .46052632  .45454545 | .45493562
           |         .  .50636968  .50174521  .50175132  .50174521 | .49903711
           |         0         13         78         76         66 |       233
-----------+-------------------------------------------------------+----------
      1965 |        .8  .53571429      .5875  .58571429  .56923077 | .57961783
           | .41403934  .50171822  .49539014  .49615499  .49903754 |  .4944082
           |        15         84         80         70         65 |       314
-----------+-------------------------------------------------------+----------
      1966 | .61904762  .56363636  .57692308  .47916667         .5 | .54794521
           | .48952154   .5005048   .4988675  .50485234  .50341301 | .49855036
           |        63         55         52         48         74 |       292
-----------+-------------------------------------------------------+----------
      1967 | .51388889  .50793651  .56140351   .5308642         .5 | .52161383
           | .50331452  .50395263  .50062617  .50215585  .50341301 | .50025397
           |        72         63         57         81         74 |       347
-----------+-------------------------------------------------------+----------
      1968 | .61428571         .5  .43835616  .41428571  .42424242 | .47800587
           | .49027816   .5040817  .49961934  .49615499  .49801471 | .50025007
           |        70         62         73         70         66 |       341
-----------+-------------------------------------------------------+----------
      1969 | .46938776  .53424658  .41666667  .51851852  .40336134 | .45776567
           | .50423378  .50227792  .49646639  .50434866  .49264639 | .49889322
           |        49         73         72         54        119 |       367
-----------+-------------------------------------------------------+----------
      1970 | .54166667  .44444444  .57142857  .56880734  .51807229 | .53061224
           | .50175747  .50039108  .49935023  .49753043  .50271084 | .49969979
           |        72         72         56        109         83 |       392
-----------+-------------------------------------------------------+----------
      1971 | .49253731  .40350877  .46428571  .38636364  .43589744 | .43781095
           | .50371752  .49496209  .50096432  .48970594  .49908341 | .49673566
           |        67         57        112         88         78 |       402
-----------+-------------------------------------------------------+----------
      1972 |        .5  .51754386   .4893617  .58139535  .55421687 | .52913753
           | .50487816  .50189828  .50256719  .49622377  .50007346 | .49973306
           |        52        114         94         86         83 |       429
-----------+-------------------------------------------------------+----------
      1973 | .38709677  .30985915  .42857143  .44067797     .46875 | .39622642
           | .48972614  .46572675   .4988466  .50073003  .50700735 | .48988337
           |        93         71         63         59         32 |       318
-----------+-------------------------------------------------------+----------
      1974 | .51111111  .48192771  .53246753  .58823529  .46428571 | .50882353
           | .50267698  .50271084  .50221655  .49955417  .50323628 | .50065894
           |        90         83         77         34         56 |       340
-----------+-------------------------------------------------------+----------
      1975 | .41791045  .46774194  .53333333  .38823529       .375 | .41975309
           | .49693771  .50303153  .50741626  .49024089  .48717735 | .49428179
           |        67         62         30         85         80 |       324
-----------+-------------------------------------------------------+----------
      1976 | .38983051        .32  .50617284  .46987952  .44594595 | .44720497
           | .49189812  .47609523  .50307695  .50212595  .50046258 | .49797873
           |        59         25         81         83         74 |       322
-----------+-------------------------------------------------------+----------
      1977 |    .40625  .41791045  .45070423  .40322581  .39285714 | .41666667
           | .49899092  .49693771  .50110542  .49454988  .49280538 |  .4938648
           |        32         67         71         62         56 |       288
-----------+-------------------------------------------------------+----------
      1978 | .38888889  .43661972  .42424242   .3442623  .42592593 | .40432099
           |  .4909191  .49949673  .49801471  .47907014  .49912572 | .49151926
           |        72         71         66         61         54 |       324
-----------+-------------------------------------------------------+----------
      1979 | .46478873  .38461538  .35820896  .41538462  .37735849 | .40186916
           | .50230855  .49029034  .48309271  .49662321  .48936439 | .49104124
           |        71         65         67         65         53 |       321
-----------+-------------------------------------------------------+----------
      1980 | .25806452  .41666667  .39655172  .39130435          . | .36283186
           | .44114173  .49716712  .49345382  .49343516          . | .48188421
           |        62         60         58         46          0 |       226
-----------+-------------------------------------------------------+----------
      1981 |       .45  .43243243  .44776119          .          . | .44343891
           | .50063251  .49879529  .50101661          .          . | .49791833
           |        80         74         67          0          0 |       221
-----------+-------------------------------------------------------+----------
      1982 | .55172414  .48148148          .          .          . | .51785714
           | .50166088  .50434866          .          .          . | .50192679
           |        58         54          0          0          0 |       112
-----------+-------------------------------------------------------+----------
      1983 | .41463415          .          .          .          . | .41463415
           |   .498779          .          .          .          . |   .498779
           |        41          0          0          0          0 |        41
-----------+-------------------------------------------------------+----------
     Total | .47257384  .45959184  .47689898  .47237354  .45771916 | .46781664
           | .49945803  .49856804  .49966174  .49943056  .49840249 | .49900301
           |      1185       1225       1277       1285       1289 |      6261

. 
. tab birthyr age if inrange(age,25,29) & firstObs &  male, sum(empFT) 

            Means, Standard Deviations and Frequencies of empFT

  PE: Year |                        age
  of birth |        25         26         27         28         29 |     Total
-----------+-------------------------------------------------------+----------
      1966 |         .          .          .          .  .63157895 | .63157895
           |         .          .          .          .  .49559463 | .49559463
           |         0          0          0          0         19 |        19
-----------+-------------------------------------------------------+----------
      1967 |         .          .          .  .64285714  .75362319 | .73493976
           |         .          .          .  .49724516  .43405737 | .44404838
           |         0          0          0         14         69 |        83
-----------+-------------------------------------------------------+----------
      1968 |         .          .  .55555556  .67741935  .71186441 | .67625899
           |         .          .  .51130999  .47127986  .45678213 | .46959476
           |         0          0         18         62         59 |       139
-----------+-------------------------------------------------------+----------
      1969 |         .  .90909091  .72580645  .73333333  .81132075 | .76344086
           |         .  .30151134  .44974874  .44594849  .39499775 | .42611633
           |         0         11         62         60         53 |       186
-----------+-------------------------------------------------------+----------
      1970 |       .75  .75362319  .77777778   .8245614  .83018868 | .79007634
           | .44426166  .43405737  .41907904   .3837227  .37906002 | .40803331
           |        20         69         63         57         53 |       262
-----------+-------------------------------------------------------+----------
      1971 | .73469388  .76595745  .77777778  .63888889  .75806452 | .73913043
           | .44607129  .42797633  .42163702  .48713611  .43175144 | .44006662
           |        49         47         36         36         62 |       230
-----------+-------------------------------------------------------+----------
      1972 | .81666667  .78571429  .81132075  .80952381  .70491803 | .78498294
           | .39020493  .41403934  .39499775  .39583081  .45986456 | .41153707
           |        60         56         53         63         61 |       293
-----------+-------------------------------------------------------+----------
      1973 |       .75  .76086957  .75409836  .81034483  .70454545 | .75875486
           | .43759497  .43126597  .43419418  .39545206  .46152152 | .42867347
           |        48         46         61         58         44 |       257
-----------+-------------------------------------------------------+----------
      1974 | .66129032  .76811594  .84482759        .84  .72527473 | .76060606
           | .47713449  .42512723   .3652312  .37032804  .44884875 | .42736159
           |        62         69         58         50         91 |       330
-----------+-------------------------------------------------------+----------
      1975 | .68918919  .70512821  .64705882      .6875        .65 | .67718447
           | .46598476   .4589365  .48143771  .46559562   .4799789 |  .4681213
           |        74         78         68        112         80 |       412
-----------+-------------------------------------------------------+----------
      1976 |        .7     .65625  .72580645  .66666667  .75510204 | .70445344
           | .46291005   .4825587  .44974874  .47583095  .43448304 | .45721453
           |        50         32         62         54         49 |       247
-----------+-------------------------------------------------------+----------
      1977 | .67272727  .71171171   .6626506  .60810811  .71014493 | .67602041
           | .47354242  .45502023  .47567945  .49150503  .45701877 |  .4685904
           |        55        111         83         74         69 |       392
-----------+-------------------------------------------------------+----------
      1978 | .66336634  .50649351  .49295775  .49206349  .64285714 | .55882353
           | .47491531  .50323628  .50350881  .50395263  .48795004 | .49725954
           |       101         77         71         63         28 |       340
-----------+-------------------------------------------------------+----------
      1979 |  .6091954  .64556962  .68333333  .48148148  .58461538 |  .6163522
           |  .4907593  .48139686   .4691018  .50917508  .49662321 | .48704014
           |        87         79         60         27         65 |       318
-----------+-------------------------------------------------------+----------
      1980 | .49253731  .59259259  .56521739  .56716418  .40298507 | .51438849
           | .50371752  .49596555   .5068698  .49920788  .49419974 | .50069427
           |        67         54         23         67         67 |       278
-----------+-------------------------------------------------------+----------
      1981 | .55769231  .51724138  .53030303  .46268657    .484375 | .50719424
           | .50150603  .50854763  .50290531  .50236888   .5037065 | .50084986
           |        52         29         66         67         64 |       278
-----------+-------------------------------------------------------+----------
      1982 | .52777778  .58208955  .49315068  .56451613  .56363636 | .54607509
           |  .5063094  .49693771  .50341301  .49986778   .5005048 | .49872435
           |        36         67         73         62         55 |       293
-----------+-------------------------------------------------------+----------
      1983 | .61111111  .36206897  .47272727  .49056604  .51923077 | .48897059
           | .49207557  .48479606  .50385718  .50469494   .5045046 | .50079977
           |        54         58         55         53         52 |       272
-----------+-------------------------------------------------------+----------
      1984 | .42857143  .51724138  .61702128         .6      .5625 | .53648069
           | .49935023  .50406694  .49136861  .49613894  .50401613 | .49974094
           |        56         58         47         40         32 |       233
-----------+-------------------------------------------------------+----------
      1985 | .31147541  .36538462  .41463415     .46875          . | .37634409
           | .46693981  .48623589    .498779  .50700735          . | .48577558
           |        61         52         41         32          0 |       186
-----------+-------------------------------------------------------+----------
      1986 | .49019608  .53448276  .58974359          .          . | .53378378
           | .50487816  .50316602  .49831024          .          . | .50055127
           |        51         58         39          0          0 |       148
-----------+-------------------------------------------------------+----------
      1987 | .40677966  .51923077          .          .          . | .45945946
           | .49544978   .5045046          .          .          . | .50061387
           |        59         52          0          0          0 |       111
-----------+-------------------------------------------------------+----------
      1988 | .39130435          .          .          .          . | .39130435
           | .49343516          .          .          .          . | .49343516
           |        46          0          0          0          0 |        46
-----------+-------------------------------------------------------+----------
     Total | .59191176  .62466002  .64388835  .64319696  .66044776 |  .6325425
           | .49170565  .48443022  .47907937  .47928405  .47377833 | .48215756
           |      1088       1103       1039       1051       1072 |      5353

. tab birthyr age if inrange(age,25,29) & firstObs & ~male, sum(empFT) 

            Means, Standard Deviations and Frequencies of empFT

  PE: Year |                        age
  of birth |        25         26         27         28         29 |     Total
-----------+-------------------------------------------------------+----------
      1966 |         .          .          .          .  .91666667 | .91666667
           |         .          .          .          .  .28867513 | .28867513
           |         0          0          0          0         12 |        12
-----------+-------------------------------------------------------+----------
      1967 |         .          .          .         .6  .51898734 | .53191489
           |         .          .          .  .50709255  .50283197 | .50165592
           |         0          0          0         15         79 |        94
-----------+-------------------------------------------------------+----------
      1968 |         .          .  .44444444  .44871795  .55128205 | .49425287
           |         .          .  .51130999  .50058241  .50058241 | .50140988
           |         0          0         18         78         78 |       174
-----------+-------------------------------------------------------+----------
      1969 |         .  .36842105  .48484848        .55  .49056604 | .49494949
           |         .  .49559463  .50360009  .50169205  .50469494 | .50124186
           |         0         19         66         60         53 |       198
-----------+-------------------------------------------------------+----------
      1970 | .29411765  .38571429  .45070423  .48275862  .50980392 | .44194757
           | .46966822  .49027816  .50110542  .50406694  .50487816 |  .4975511
           |        17         70         71         58         51 |       267
-----------+-------------------------------------------------------+----------
      1971 | .50574713  .51948052         .6         .7  .59259259 | .57567568
           | .50286535   .5028966  .49371044  .46212479  .49441323 | .49490926
           |        87         77         65         60         81 |       370
-----------+-------------------------------------------------------+----------
      1972 | .50769231  .52542373  .52830189  .54285714  .51666667 | .52442997
           | .50383147  .50363959  .50397549  .50175675  .50393928 | .50021817
           |        65         59         53         70         60 |       307
-----------+-------------------------------------------------------+----------
      1973 | .56451613  .62264151  .62711864         .5  .46808511 |       .56
           | .49986778  .48936439  .48772184  .50469494  .50437494 | .49729194
           |        62         53         59         54         47 |       275
-----------+-------------------------------------------------------+----------
      1974 |       .58  .59677419  .51470588  .55172414  .57894737 | .56534091
           | .49856938  .49454988  .50349961  .50166088   .4959078 | .49641782
           |        50         62         68         58        114 |       352
-----------+-------------------------------------------------------+----------
      1975 |        .5  .55555556  .50909091  .47368421  .43661972 | .49137931
           | .50395263  .50089526  .50452498  .50195586  .49949673 | .50064551
           |        64         63         55         95         71 |       348
-----------+-------------------------------------------------------+----------
      1976 |        .5        .56         .5  .44262295       .375 | .47384615
           | .50395263  .50142654  .50293258    .500819  .48795004 | .50008546
           |        64         50         86         61         64 |       325
-----------+-------------------------------------------------------+----------
      1977 | .55737705  .56074766  .48611111  .49206349      .4375 | .51226158
           |   .500819  .49863153  .50331452  .50395263         .5 | .50053202
           |        61        107         72         63         64 |       367
-----------+-------------------------------------------------------+----------
      1978 | .58888889        .44  .37333333  .49253731  .48275862 | .47916667
           | .49479185  .49972966  .48694673  .50371752  .50854763 | .50031085
           |        90         75         75         67         29 |       336
-----------+-------------------------------------------------------+----------
      1979 | .42857143  .49411765  .53164557       .475  .50684932 | .48753463
           | .49784389  .50293258  .50218607  .50573633  .50341301 | .50053834
           |        84         85         79         40         73 |       361
-----------+-------------------------------------------------------+----------
      1980 | .40740741  .42857143  .40909091  .36363636    .359375 | .39189189
           | .49441323   .4988466  .50323628  .48473192  .48361035 | .48899946
           |        81         63         22         66         64 |       296
-----------+-------------------------------------------------------+----------
      1981 | .53623188  .47222222  .45348837  .43820225  .51764706 | .48219178
           | .50233895   .5063094  .50075183   .4989775  .50265402 | .50036867
           |        69         36         86         89         85 |       365
-----------+-------------------------------------------------------+----------
      1982 |        .4  .49275362  .45205479  .44285714  .48484848 | .46103896
           | .49827288  .50361016  .50114025  .50031046  .50360009 | .49929092
           |        30         69         73         70         66 |       308
-----------+-------------------------------------------------------+----------
      1983 | .36842105         .4   .4516129  .39285714  .32653061 | .39100346
           | .48666426  .49371044  .50171572  .49280538  .47380354 |  .4888216
           |        57         65         62         56         49 |       289
-----------+-------------------------------------------------------+----------
      1984 | .38271605  .32876712  .36065574  .45283019         .5 | .39354839
           | .48907825  .47301616  .48417582  .50253349  .50606083 | .48932652
           |        81         73         61         53         42 |       310
-----------+-------------------------------------------------------+----------
      1985 |       .42       .525       .425  .44444444          . | .45180723
           | .49856938  .50573633  .50064062  .50395263          . | .49917786
           |        50         40         40         36          0 |       166
-----------+-------------------------------------------------------+----------
      1986 | .38571429  .44444444  .47826087          .          . |  .4301676
           | .49027816  .50089526  .50504699          .          . |  .4964882
           |        70         63         46          0          0 |       179
-----------+-------------------------------------------------------+----------
      1987 | .36923077  .43137255          .          .          . | .39655172
           |  .4863522  .50019604          .          .          . | .49130368
           |        65         51          0          0          0 |       116
-----------+-------------------------------------------------------+----------
      1988 | .37096774          .          .          .          . | .37096774
           | .48700729          .          .          .          . | .48700729
           |        62          0          0          0          0 |        62
-----------+-------------------------------------------------------+----------
     Total | .46484698  .48474576  .48141746  .48302872  .49407783 |  .4815382
           | .49896913  .49997915  .49987064  .49992949  .50017655 | .49970156
           |      1209       1180       1157       1149       1182 |      5877

. 
. *****************************************************************************
. * Wages/earnings
. *****************************************************************************
. /* Earnings are by month.  */
. gen     monthly_earnings = (0)*(earnings_job1_month<0) + (earnings_job1_month)*inrange(earnings_job1_month,0,.)+ (earnings_job2_month)*inrange(earnings_jo
> b2_month,0,.)

. by  pidsvy year: egen annual_earnings = total(monthly_earnings)

. gen annual_earnings_imputed = annual_earnings*(12/numObs)

. 
. gen wage1 = annual_earnings/(annual_wksem*average_weekly_hours)
(830,748 missing values generated)

. 
. * This generates lots of missing values, but also some zero values which are concerning (above)
. 
. * Average hours worked/week IF employed
. by  pidsvy year: egen average_wage     = mean(wage_month) if inrange(wage_month,0.01,.)
(1155458 missing values generated)

. by  pidsvy year: egen average_wage_max = max(average_wage)
(1062869 missing values generated)

. replace               average_wage     = max(0,average_wage_max)
(1,155,458 real changes made)

. 
. save sipp_jared.dta, replace
file sipp_jared.dta saved

. 
. log close
      name:  <unnamed>
       log:  /home/jared/NLSYvCPS/Data/SIPP/sipp_jared.log
  log type:  text
 closed on:   6 Jul 2018, 10:39:38
------------------------------------------------------------------------------------------------------------------------------------------------------------
