------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/data/ransom/NLSYvCPS/Analysis/NLSY/nlsy_attrition.log
  log type:  text
 opened on:   6 Jul 2018, 11:54:42

. 
. * y79attritionAge2930ByBirthYr.dta
. * y79cumAttritionAge2930ByBirthYr.dta
. 
. foreach panel in 79 97 {
  2.     append using ../../Data/NLSY/y`panel'/y`panel'attritionByCalYr.dta
  3. }

. generat panel = 1997

. replace panel = 1979 if _n<=25
(25 real changes made)

. l

     +---------------------------------+
     | year    missInt   round   panel |
     |---------------------------------|
  1. | 1979          0       1    1979 |
  2. | 1980   .0404589       2    1979 |
  3. | 1981   .0345181       3    1979 |
  4. | 1982   .0419953       4    1979 |
  5. | 1983   .0363618       5    1979 |
     |---------------------------------|
  6. | 1984   .0470142       6    1979 |
  7. | 1985    .060125       7    1979 |
  8. | 1986   .0810202       8    1979 |
  9. | 1987   .0963843       9    1979 |
 10. | 1988   .0985353      10    1979 |
     |---------------------------------|
 11. | 1989   .0865513      11    1979 |
 12. | 1990   .1017105      12    1979 |
 13. | 1991   .0948479      13    1979 |
 14. | 1992   .0952576      14    1979 |
 15. | 1993   .0955649      15    1979 |
     |---------------------------------|
 16. | 1994   .1075489      16    1979 |
 17. | 1996   .1333607      17    1979 |
 18. | 1998    .157636      18    1979 |
 19. | 2000   .1938953      19    1979 |
 20. | 2002   .2249309      20    1979 |
     |---------------------------------|
 21. | 2004   .2313838      21    1979 |
 22. | 2006   .2326129      22    1979 |
 23. | 2008   .2219605      23    1979 |
 24. | 2010    .241012      24    1979 |
 25. | 2012   .2672334      25    1979 |
     |---------------------------------|
 26. | 1997          0       1    1997 |
 27. | 1998   .0665628       2    1997 |
 28. | 1999   .0863758       3    1997 |
 29. | 2000   .1006233       4    1997 |
 30. | 2001   .1226625       5    1997 |
     |---------------------------------|
 31. | 2002   .1211042       6    1997 |
 32. | 2003   .1369101       7    1997 |
 33. | 2004   .1649599       8    1997 |
 34. | 2005   .1832146       9    1997 |
 35. | 2006   .1586153      10    1997 |
     |---------------------------------|
 36. | 2007   .1743099      11    1997 |
 37. | 2008   .1662956      12    1997 |
 38. | 2009   .1586153      13    1997 |
 39. | 2010     .16752      14    1997 |
 40. | 2011   .1737533      15    1997 |
     |---------------------------------|
 41. | 2013   .2052538      16    1997 |
 42. | 2015   .2093722      17    1997 |
     +---------------------------------+

. 
. twoway ( line missInt round if panel==1979 , lwidth(medthick) lcolor(black) lpattern(solid)) ///
>        ( line missInt round if panel==1997 , lwidth(medthick) lcolor(black) lpattern(shortdash_dot)) ///
> , legend(order(1 2) label(1 "NLSY79") label(2 "NLSY97") cols(2) symxsize(10) keygap(1) ) ///
> xscale(range(1 25)) xlabel(1(2)25) xtitle(Survey round) ytitle(Proportion missing current round interview) graphregion(color(white))

. graph export ../PDFs/nlsy_rd_by_rd_attrition.pdf, replace
(file ../PDFs/nlsy_rd_by_rd_attrition.pdf written in PDF format)

. graph export  ../PSs/nlsy_rd_by_rd_attrition.eps, replace
(file ../PSs/nlsy_rd_by_rd_attrition.eps written in EPS format)

. 
. clear

. foreach panel in 79 97 {
  2.     append using ../../Data/NLSY/y`panel'/y`panel'cumAttritionByCalYr.dta
  3. }

. generat panel = 1997

. replace panel = 1979 if _n<=25
(25 real changes made)

. l

     +---------------------------------+
     | year   missIn~e   round   panel |
     |---------------------------------|
  1. | 1979          0       1    1979 |
  2. | 1980   .0404589       2    1979 |
  3. | 1981   .0571546       3    1979 |
  4. | 1982   .0730308       4    1979 |
  5. | 1983   .0834784       5    1979 |
     |---------------------------------|
  6. | 1984   .1015057       6    1979 |
  7. | 1985   .1233227       7    1979 |
  8. | 1986   .1482126       8    1979 |
  9. | 1987   .1750486       9    1979 |
 10. | 1988   .1991191      10    1979 |
     |---------------------------------|
 11. | 1989   .2123323      11    1979 |
 12. | 1990   .2302571      12    1979 |
 13. | 1991   .2423435      13    1979 |
 14. | 1992   .2549421      14    1979 |
 15. | 1993   .2652873      15    1979 |
     |---------------------------------|
 16. | 1994   .2792175      16    1979 |
 17. | 1996   .3010345      17    1979 |
 18. | 1998   .3283827      18    1979 |
 19. | 2000   .3638226      19    1979 |
 20. | 2002   .3948582      20    1979 |
     |---------------------------------|
 21. | 2004   .4221039      21    1979 |
 22. | 2006   .4421797      22    1979 |
 23. | 2008   .4552904      23    1979 |
 24. | 2010   .4749565      24    1979 |
 25. | 2012   .4945201      25    1979 |
     |---------------------------------|
 26. | 1997          0       1    1997 |
 27. | 1998   .0665628       2    1997 |
 28. | 1999    .114203       3    1997 |
 29. | 2000   .1553874       4    1997 |
 30. | 2001   .1982413       5    1997 |
     |---------------------------------|
 31. | 2002   .2267364       6    1997 |
 32. | 2003   .2566786       7    1997 |
 33. | 2004   .2956367       8    1997 |
 34. | 2005    .333927       9    1997 |
 35. | 2006   .3532948      10    1997 |
     |---------------------------------|
 36. | 2007   .3741095      11    1997 |
 37. | 2008   .3892475      12    1997 |
 38. | 2009   .4008237      13    1997 |
 39. | 2010   .4112867      14    1997 |
 40. | 2011   .4229742      15    1997 |
     |---------------------------------|
 41. | 2013   .4472395      16    1997 |
 42. | 2015   .4647151      17    1997 |
     +---------------------------------+

. 
. twoway ( line missInt round if panel==1979 , lwidth(medthick) lcolor(black) lpattern(solid)) ///
>        ( line missInt round if panel==1997 , lwidth(medthick) lcolor(black) lpattern(shortdash_dot)) ///
> , legend(order(1 2) label(1 "NLSY79") label(2 "NLSY97") cols(2) symxsize(10) keygap(1) ) ///
> xscale(range(1 25)) xlabel(1(2)25) xtitle(Survey round) ytitle("Proportion ever missed interview" "in current or any previous round") graphregion(color(white))

. graph export ../PDFs/nlsy_cum_attrition.pdf, replace
(file ../PDFs/nlsy_cum_attrition.pdf written in PDF format)

. graph export  ../PSs/nlsy_cum_attrition.eps, replace
(file ../PSs/nlsy_cum_attrition.eps written in EPS format)

. 
. 
end of do-file

. exit, clear
