
. 
. !gunzip -f ../../Data/NLSY/yCombinedAnalysis.dta.gz


. use        ../../Data/NLSY/yCombinedAnalysis.dta

. !gzip   -f ../../Data/NLSY/yCombinedAnalysis.dta


. 
. *** 79
. * Command from data_append.do
. reg lnwage     gradHS grad4yr if cohortFlag==1979 & inrange(age,25,34) & empF
> T==1 & !female

      Source |       SS           df       MS      Number of obs   =    23,772
-------------+----------------------------------   F(2, 23769)     =   1424.50
       Model |   639.27815         2  319.639075   Prob > F        =    0.0000
    Residual |  5333.44398    23,769  .224386553   R-squared       =    0.1070
-------------+----------------------------------   Adj R-squared   =    0.1070
       Total |  5972.72213    23,771   .25126087   Root MSE        =    .47369

------------------------------------------------------------------------------
      lnwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      gradHS |   .1989117   .0097776    20.34   0.000      .179747    .2180764
     grad4yr |   .3418833   .0076557    44.66   0.000     .3268777     .356889
       _cons |   1.803719   .0090314   199.72   0.000     1.786017    1.821421
------------------------------------------------------------------------------

. reg lnwage hgc gradHS grad4yr if cohortFlag==1979 & inrange(age,25,34) & empF
> T==1 & !female

      Source |       SS           df       MS      Number of obs   =    23,737
-------------+----------------------------------   F(3, 23733)     =   1107.23
       Model |  732.240367         3  244.080122   Prob > F        =    0.0000
    Residual |  5231.76486    23,733  .220442627   R-squared       =    0.1228
-------------+----------------------------------   Adj R-squared   =    0.1227
       Total |  5964.00523    23,736  .251264123   Root MSE        =    .46951

------------------------------------------------------------------------------
      lnwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         hgc |   .0524686   .0025913    20.25   0.000     .0473894    .0575477
      gradHS |   .0380479   .0126824     3.00   0.003     .0131895    .0629063
     grad4yr |   .1198769   .0133342     8.99   0.000     .0937411    .1460127
       _cons |   1.311009   .0257865    50.84   0.000     1.260465    1.361552
------------------------------------------------------------------------------

. 
. * Command from data_append.do (different age range)
. reg lnwage     gradHS grad4yr if cohortFlag==1979 & inrange(age,16,28) & empF
> T==1 & !female

      Source |       SS           df       MS      Number of obs   =    21,006
-------------+----------------------------------   F(2, 21003)     =    922.03
       Model |  364.279711         2  182.139855   Prob > F        =    0.0000
    Residual |  4148.96824    21,003  .197541696   R-squared       =    0.0807
-------------+----------------------------------   Adj R-squared   =    0.0806
       Total |  4513.24795    21,005  .214865411   Root MSE        =    .44446

------------------------------------------------------------------------------
      lnwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      gradHS |   .1601463   .0089088    17.98   0.000     .1426844    .1776081
     grad4yr |   .3245943   .0091125    35.62   0.000     .3067331    .3424555
       _cons |   1.712086   .0081473   210.14   0.000     1.696116    1.728055
------------------------------------------------------------------------------

. reg lnwage hgc gradHS grad4yr if cohortFlag==1979 & inrange(age,16,28) & empF
> T==1 & !female

      Source |       SS           df       MS      Number of obs   =    20,965
-------------+----------------------------------   F(3, 20961)     =    732.95
       Model |  427.160195         3  142.386732   Prob > F        =    0.0000
    Residual |    4071.984    20,961  .194264777   R-squared       =    0.0949
-------------+----------------------------------   Adj R-squared   =    0.0948
       Total |  4499.14419    20,964  .214612869   Root MSE        =    .44075

------------------------------------------------------------------------------
      lnwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         hgc |   .0460418   .0026213    17.56   0.000     .0409039    .0511798
      gradHS |   .0280146   .0117901     2.38   0.018      .004905    .0511242
     grad4yr |   .1362097   .0140238     9.71   0.000      .108722    .1636974
       _cons |   1.277549   .0258275    49.46   0.000     1.226925    1.328173
------------------------------------------------------------------------------

. 
. * Modified commands
. reg lnwage gradHS grad4yr        if cohortFlag==1979 & inrange(age,25,34)  & 
> !female

      Source |       SS           df       MS      Number of obs   =    29,896
-------------+----------------------------------   F(2, 29893)     =   1551.49
       Model |  818.669358         2  409.334679   Prob > F        =    0.0000
    Residual |  7886.76748    29,893  .263833254   R-squared       =    0.0940
-------------+----------------------------------   Adj R-squared   =    0.0940
       Total |  8705.43683    29,895  .291200429   Root MSE        =    .51365

------------------------------------------------------------------------------
      lnwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      gradHS |    .203004   .0090508    22.43   0.000      .185264     .220744
     grad4yr |   .3467679   .0075785    45.76   0.000     .3319138    .3616221
       _cons |   1.752866   .0082943   211.33   0.000     1.736609    1.769123
------------------------------------------------------------------------------

. reg lnwage gradHS grad4yr empPT  if cohortFlag==1979 & inrange(age,25,34)  & 
> !female

      Source |       SS           df       MS      Number of obs   =    29,857
-------------+----------------------------------   F(3, 29853)     =   1393.55
       Model |  1066.36267         3  355.454222   Prob > F        =    0.0000
    Residual |  7614.64057    29,853  .255071201   R-squared       =    0.1228
-------------+----------------------------------   Adj R-squared   =    0.1228
       Total |  8681.00324    29,856  .290762434   Root MSE        =    .50505

------------------------------------------------------------------------------
      lnwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      gradHS |   .1849446   .0089242    20.72   0.000     .1674529    .2024364
     grad4yr |   .3353198   .0074636    44.93   0.000     .3206909    .3499487
       empPT |  -.2278185   .0072845   -31.27   0.000    -.2420964   -.2135407
       _cons |    1.81746   .0084156   215.96   0.000     1.800965    1.833955
------------------------------------------------------------------------------

. reg lnwage gradHS grad4yr empPT  if cohortFlag==1979 & inrange(age,25,34)  & 
> !female & inlist(birthyr,1959,1960)

      Source |       SS           df       MS      Number of obs   =     7,900
-------------+----------------------------------   F(3, 7896)      =    286.06
       Model |  228.407902         3  76.1359674   Prob > F        =    0.0000
    Residual |  2101.52576     7,896  .266150678   R-squared       =    0.0980
-------------+----------------------------------   Adj R-squared   =    0.0977
       Total |  2329.93366     7,899  .294965649   Root MSE        =     .5159

------------------------------------------------------------------------------
      lnwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      gradHS |   .2269016    .016868    13.45   0.000     .1938359    .2599674
     grad4yr |   .2731302   .0159106    17.17   0.000     .2419412    .3043192
       empPT |  -.2207921   .0146018   -15.12   0.000    -.2494154   -.1921687
       _cons |    1.79631   .0157995   113.69   0.000     1.765339    1.827281
------------------------------------------------------------------------------

. reg lnwage gradHS grad4yr empPT  if cohortFlag==1979 & inrange(age,25,34)  & 
> !female & inlist(birthyr,1961,1962,1963,1964)

      Source |       SS           df       MS      Number of obs   =    15,143
-------------+----------------------------------   F(3, 15139)     =    783.53
       Model |  575.390385         3  191.796795   Prob > F        =    0.0000
    Residual |  3705.80184    15,139  .244785114   R-squared       =    0.1344
-------------+----------------------------------   Adj R-squared   =    0.1342
       Total |  4281.19222    15,142  .282736245   Root MSE        =    .49476

------------------------------------------------------------------------------
      lnwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      gradHS |   .1483248   .0127679    11.62   0.000     .1232981    .1733514
     grad4yr |   .3687993   .0102061    36.14   0.000     .3487942    .3888044
       empPT |  -.2235333   .0098736   -22.64   0.000    -.2428868   -.2041797
       _cons |    1.82799   .0121418   150.55   0.000     1.804191     1.85179
------------------------------------------------------------------------------

. 
. *** 97
. * Command from data_append.do
. reg lnwage     gradHS grad4yr if cohortFlag==1997 & inrange(age,25,34) & empF
> T==1 & !female

      Source |       SS           df       MS      Number of obs   =    12,807
-------------+----------------------------------   F(2, 12804)     =    552.05
       Model |  321.071618         2  160.535809   Prob > F        =    0.0000
    Residual |  3723.42218    12,804  .290801483   R-squared       =    0.0794
-------------+----------------------------------   Adj R-squared   =    0.0792
       Total |   4044.4938    12,806  .315828034   Root MSE        =    .53926

------------------------------------------------------------------------------
      lnwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      gradHS |   .1778711   .0175434    10.14   0.000     .1434835    .2122587
     grad4yr |   .3041704   .0105172    28.92   0.000     .2835552    .3247856
       _cons |   1.883902   .0164396   114.60   0.000     1.851678    1.916126
------------------------------------------------------------------------------

. reg lnwage hgc gradHS grad4yr if cohortFlag==1997 & inrange(age,25,34) & empF
> T==1 & !female

      Source |       SS           df       MS      Number of obs   =    12,807
-------------+----------------------------------   F(3, 12803)     =    428.45
       Model |  369.001976         3  123.000659   Prob > F        =    0.0000
    Residual |  3675.49182    12,803  .287080514   R-squared       =    0.0912
-------------+----------------------------------   Adj R-squared   =    0.0910
       Total |   4044.4938    12,806  .315828034   Root MSE        =     .5358

------------------------------------------------------------------------------
      lnwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         hgc |   .0425327   .0032917    12.92   0.000     .0360805    .0489849
      gradHS |   .0599145   .0196766     3.04   0.002     .0213454    .0984835
     grad4yr |   .1111344   .0182314     6.10   0.000     .0753982    .1468706
       _cons |   1.472726   .0357691    41.17   0.000     1.402613    1.542839
------------------------------------------------------------------------------

. 
. * Command from data_append.do
. reg lnwage     gradHS grad4yr if cohortFlag==1997 & inrange(age,16,28) & empF
> T==1 & !female

      Source |       SS           df       MS      Number of obs   =    18,814
-------------+----------------------------------   F(2, 18811)     =    756.68
       Model |   384.43353         2  192.216765   Prob > F        =    0.0000
    Residual |   4778.4802    18,811  .254025847   R-squared       =    0.0745
-------------+----------------------------------   Adj R-squared   =    0.0744
       Total |  5162.91373    18,813  .274433303   Root MSE        =    .50401

------------------------------------------------------------------------------
      lnwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      gradHS |   .1380604   .0118617    11.64   0.000     .1148103    .1613105
     grad4yr |   .3299996    .009539    34.59   0.000     .3113024    .3486968
       _cons |    1.75749   .0110194   159.49   0.000     1.735891     1.77909
------------------------------------------------------------------------------

. reg lnwage hgc gradHS grad4yr if cohortFlag==1997 & inrange(age,16,28) & empF
> T==1 & !female

      Source |       SS           df       MS      Number of obs   =    18,814
-------------+----------------------------------   F(3, 18810)     =    593.10
       Model |  446.175287         3  148.725096   Prob > F        =    0.0000
    Residual |  4716.73844    18,810  .250756961   R-squared       =    0.0864
-------------+----------------------------------   Adj R-squared   =    0.0863
       Total |  5162.91373    18,813  .274433303   Root MSE        =    .50076

------------------------------------------------------------------------------
      lnwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         hgc |    .041485   .0026438    15.69   0.000      .036303    .0466671
      gradHS |   .0328124   .0135602     2.42   0.016     .0062332    .0593916
     grad4yr |   .1467929    .015038     9.76   0.000     .1173172    .1762686
       _cons |   1.354122   .0279406    48.46   0.000     1.299356    1.408888
------------------------------------------------------------------------------

. 
. * Modified commands
. reg lnwage gradHS grad4yr        if cohortFlag==1997 & inrange(age,25,34)  & 
> !female

      Source |       SS           df       MS      Number of obs   =    18,419
-------------+----------------------------------   F(2, 18416)     =    708.17
       Model |  490.930128         2  245.465064   Prob > F        =    0.0000
    Residual |  6383.30867    18,416  .346617543   R-squared       =    0.0714
-------------+----------------------------------   Adj R-squared   =    0.0713
       Total |   6874.2388    18,418  .373234814   Root MSE        =    .58874

------------------------------------------------------------------------------
      lnwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      gradHS |   .1670897   .0142968    11.69   0.000     .1390666    .1951128
     grad4yr |   .3236133     .00997    32.46   0.000     .3040712    .3431553
       _cons |   1.806866   .0131911   136.98   0.000     1.781011    1.832722
------------------------------------------------------------------------------

. reg lnwage gradHS grad4yr empPT  if cohortFlag==1997 & inrange(age,25,34)  & 
> !female

      Source |       SS           df       MS      Number of obs   =    18,419
-------------+----------------------------------   F(3, 18415)     =    773.98
       Model |  769.714272         3  256.571424   Prob > F        =    0.0000
    Residual |  6104.52453    18,415  .331497395   R-squared       =    0.1120
-------------+----------------------------------   Adj R-squared   =    0.1118
       Total |   6874.2388    18,418  .373234814   Root MSE        =    .57576

------------------------------------------------------------------------------
      lnwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      gradHS |   .1338869   .0140283     9.54   0.000     .1063901    .1613837
     grad4yr |   .2942749   .0098024    30.02   0.000     .2750612    .3134886
       empPT |  -.2725409   .0093981   -29.00   0.000     -.290962   -.2541199
       _cons |   1.925077   .0135289   142.29   0.000     1.898559    1.951595
------------------------------------------------------------------------------

. reg lnwage gradHS grad4yr empPT  if cohortFlag==1997 & inrange(age,25,34)  & 
> !female & inlist(birthyr,1980,1981,1982,1983,1984)

      Source |       SS           df       MS      Number of obs   =    18,419
-------------+----------------------------------   F(3, 18415)     =    773.98
       Model |  769.714272         3  256.571424   Prob > F        =    0.0000
    Residual |  6104.52453    18,415  .331497395   R-squared       =    0.1120
-------------+----------------------------------   Adj R-squared   =    0.1118
       Total |   6874.2388    18,418  .373234814   Root MSE        =    .57576

------------------------------------------------------------------------------
      lnwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      gradHS |   .1338869   .0140283     9.54   0.000     .1063901    .1613837
     grad4yr |   .2942749   .0098024    30.02   0.000     .2750612    .3134886
       empPT |  -.2725409   .0093981   -29.00   0.000     -.290962   -.2541199
       _cons |   1.925077   .0135289   142.29   0.000     1.898559    1.951595
------------------------------------------------------------------------------

. 
. * Even after this, there are still large discrepancies
. 
. log close
      name:  <unnamed>
       log:  /home/data/ransom/NLSYvCPS/Analysis/NLSY/quick_stats.log
  log type:  text
 closed on:   4 Jan 2018, 11:19:15
-------------------------------------------------------------------------------
