
. 
. ********************************************************************
. * This do-file appends the 79 and 97 datasets for ease of comparison
. *  for tabulations, etc.
. ********************************************************************
. 
. local EY = int(10000*uniform()) // NO seed; needs to be random

. !gunzip -fc y79/master.dta.gz > tmp79`EY'.dta


. !gunzip -fc y97/master.dta.gz > tmp97`EY'.dta


. use          tmp79`EY'.dta, clear

. append using tmp97`EY'.dta, generate(cohortFlag)
(note: variable lastValidInt was byte, now int to accommodate using data's
       values)

. !rm tmp79`EY'.dta


. !rm tmp97`EY'.dta


. 
. recode  cohortFlag (0 = 1979) (1 = 1997)
(cohortFlag: 372725 changes made)

. lab var cohortFlag "Cohort Flag (1979 or 1997)"

. 
. sort    cohortFlag id year

. 
. *consolidate the cohort-specific variables:
. ren famIncAsTeen   famInc

. ren m_famIncAsTeen m_famInc

. 
. bys cohortFlag id: gen firstObs     = (_n==1)

. lab def RACE 1 "White" 2 "Black" 3 "Hispanic" 4 "Asian" 5 "Mixed"

. lab val race RACE

. 
. gen potExp = age-hgc-6
(37,495 missing values generated)

. 
. *----------------------------------------------------------------------------
> ---
. * Create period variable (=1 for each person in first period, regardless of a
> ge)
. *  and uniqueid to xtset data
. *----------------------------------------------------------------------------
> ---
. bys cohortFlag id (year): gen period = _n

. gen uniqueid = (cohortFlag-1900)*100000 + id

. 
. * Check Stata
. bys uniqueid (year): gen period2 = _n

. assert period==period2

. drop period2

. 
. xtset uniqueid period
       panel variable:  uniqueid (unbalanced)
        time variable:  period, 1 to 25
                delta:  1 unit

. 
. sum lnwage if cohortFlag==1979, d

                Log hourly wage, in 1982-84 $
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .6931472       .6931472
 5%     1.040907       .6931472
10%     1.216045       .6931472       Obs             142,290
25%     1.478771       .6931472       Sum of Wgt.     142,290

50%     1.850861                      Mean           1.890458
                        Largest       Std. Dev.      .5857724
75%     2.257612        4.60517
90%     2.620509        4.60517       Variance       .3431293
95%     2.870349        4.60517       Skewness       .5729717
99%     3.524856        4.60517       Kurtosis       4.130345

. sum lnwage if cohortFlag==1997, d

                Log hourly wage, in 1982-84 $
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .6931472       .6931472
 5%      1.06256       .6931472
10%     1.150417       .6931472       Obs             100,214
25%     1.333283       .6931472       Sum of Wgt.     100,214

50%     1.629641                      Mean           1.725826
                        Largest       Std. Dev.       .569231
75%     2.015459        4.60517
90%     2.427801        4.60517       Variance       .3240239
95%     2.720556        4.60517       Skewness       1.333203
99%     3.674698        4.60517       Kurtosis       6.660788

. reg lnwage gradHS grad4yr gradGrad if cohortFlag==1979 & inrange(age,25,34) &
>  empFT==1 & !female

      Source |       SS           df       MS      Number of obs   =    23,772
-------------+----------------------------------   F(3, 23768)     =    950.49
       Model |  639.799126         3  213.266375   Prob > F        =    0.0000
    Residual |    5332.923    23,768  .224374075   R-squared       =    0.1071
-------------+----------------------------------   Adj R-squared   =    0.1070
       Total |  5972.72213    23,771   .25126087   Root MSE        =    .47368

------------------------------------------------------------------------------
      lnwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      gradHS |   .1988993   .0097773    20.34   0.000     .1797351    .2180634
     grad4yr |   .3403328   .0077228    44.07   0.000     .3251956      .35547
    gradGrad |   .0661143   .0433883     1.52   0.128    -.0189296    .1511582
       _cons |   1.803719   .0090311   199.72   0.000     1.786018    1.821421
------------------------------------------------------------------------------

. reg lnwage gradHS grad4yr gradGrad if cohortFlag==1997 & inrange(age,25,34) &
>  empFT==1 & !female

      Source |       SS           df       MS      Number of obs   =    12,770
-------------+----------------------------------   F(3, 12766)     =    406.32
       Model |  351.623854         3  117.207951   Prob > F        =    0.0000
    Residual |  3682.55097    12,766  .288465531   R-squared       =    0.0872
-------------+----------------------------------   Adj R-squared   =    0.0869
       Total |  4034.17482    12,769  .315935063   Root MSE        =    .53709

------------------------------------------------------------------------------
      lnwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      gradHS |   .1788278   .0174818    10.23   0.000     .1445608    .2130948
     grad4yr |    .262859   .0112252    23.42   0.000     .2408559    .2848621
    gradGrad |   .2320775   .0223137    10.40   0.000     .1883392    .2758157
       _cons |   1.883527   .0163811   114.98   0.000     1.851418    1.915636
------------------------------------------------------------------------------

. reg lnwage gradHS grad4yr gradGrad if cohortFlag==1979 & inrange(age,25,34) &
>  empFT==1 &  female

      Source |       SS           df       MS      Number of obs   =    17,271
-------------+----------------------------------   F(3, 17267)     =    937.02
       Model |  526.430002         3  175.476667   Prob > F        =    0.0000
    Residual |  3233.62198    17,267  .187271789   R-squared       =    0.1400
-------------+----------------------------------   Adj R-squared   =    0.1399
       Total |  3760.05198    17,270  .217721597   Root MSE        =    .43275

------------------------------------------------------------------------------
      lnwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      gradHS |   .2844958   .0164134    17.33   0.000      .252324    .3166677
     grad4yr |    .363112    .007746    46.88   0.000      .347929    .3782949
    gradGrad |    .094801   .0431514     2.20   0.028     .0102199     .179382
       _cons |   1.535349   .0159406    96.32   0.000     1.504104    1.566594
------------------------------------------------------------------------------

. reg lnwage gradHS grad4yr gradGrad if cohortFlag==1997 & inrange(age,25,34) &
>  empFT==1 &  female

      Source |       SS           df       MS      Number of obs   =    10,367
-------------+----------------------------------   F(3, 10363)     =    702.65
       Model |  463.048612         3  154.349537   Prob > F        =    0.0000
    Residual |  2276.43024    10,363  .219669038   R-squared       =    0.1690
-------------+----------------------------------   Adj R-squared   =    0.1688
       Total |  2739.47885    10,366  .264275405   Root MSE        =    .46869

------------------------------------------------------------------------------
      lnwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      gradHS |   .2050028   .0218982     9.36   0.000     .1620781    .2479274
     grad4yr |   .2968989   .0101358    29.29   0.000     .2770307    .3167671
    gradGrad |   .2888881   .0161452    17.89   0.000     .2572405    .3205358
       _cons |   1.656835   .0208978    79.28   0.000     1.615871    1.697799
------------------------------------------------------------------------------

. 
. reg lnwage hgc gradHS grad4yr gradGrad if cohortFlag==1979 & inrange(age,25,3
> 4) & empFT==1 & !female

      Source |       SS           df       MS      Number of obs   =    23,737
-------------+----------------------------------   F(4, 23732)     =    830.45
       Model |  732.288887         4  183.072222   Prob > F        =    0.0000
    Residual |  5231.71634    23,732  .220449871   R-squared       =    0.1228
-------------+----------------------------------   Adj R-squared   =    0.1226
       Total |  5964.00523    23,736  .251264123   Root MSE        =    .46952

------------------------------------------------------------------------------
      lnwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         hgc |   .0525895   .0026042    20.19   0.000     .0474852    .0576938
      gradHS |   .0376729   .0127078     2.96   0.003     .0127648     .062581
     grad4yr |   .1198407   .0133346     8.99   0.000     .0937041    .1459774
    gradGrad |  -.0202762   .0432195    -0.47   0.639    -.1049891    .0644368
       _cons |   1.309881   .0258987    50.58   0.000     1.259118    1.360644
------------------------------------------------------------------------------

. reg lnwage hgc gradHS grad4yr gradGrad if cohortFlag==1997 & inrange(age,25,3
> 4) & empFT==1 & !female

      Source |       SS           df       MS      Number of obs   =    12,770
-------------+----------------------------------   F(4, 12765)     =    333.95
       Model |  382.169359         4  95.5423397   Prob > F        =    0.0000
    Residual |  3652.00546    12,765  .286095218   R-squared       =    0.0947
-------------+----------------------------------   Adj R-squared   =    0.0944
       Total |  4034.17482    12,769  .315935063   Root MSE        =    .53488

------------------------------------------------------------------------------
      lnwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         hgc |   .0358197   .0034666    10.33   0.000     .0290246    .0426147
      gradHS |   .0795747   .0198839     4.00   0.000     .0405991    .1185502
     grad4yr |   .1139785   .0182367     6.25   0.000      .078232    .1497251
    gradGrad |   .1568621   .0233837     6.71   0.000     .1110265    .2026977
       _cons |   1.537226   .0372743    41.24   0.000     1.464162    1.610289
------------------------------------------------------------------------------

. reg lnwage hgc gradHS grad4yr gradGrad if cohortFlag==1979 & inrange(age,25,3
> 4) & empFT==1 &  female

      Source |       SS           df       MS      Number of obs   =    17,255
-------------+----------------------------------   F(4, 17250)     =    876.94
       Model |  634.068615         4  158.517154   Prob > F        =    0.0000
    Residual |  3118.12821    17,250  .180761056   R-squared       =    0.1690
-------------+----------------------------------   Adj R-squared   =    0.1688
       Total |  3752.19682    17,254  .217468229   Root MSE        =    .42516

------------------------------------------------------------------------------
      lnwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         hgc |   .0686351   .0028721    23.90   0.000     .0630054    .0742648
      gradHS |   .0756544   .0187242     4.04   0.000     .0389531    .1123557
     grad4yr |   .0992298   .0134181     7.40   0.000     .0729289    .1255307
    gradGrad |  -.0096387   .0427986    -0.23   0.822    -.0935283     .074251
       _cons |   .8715969   .0315275    27.65   0.000     .8097998     .933394
------------------------------------------------------------------------------

. reg lnwage hgc gradHS grad4yr gradGrad if cohortFlag==1997 & inrange(age,25,3
> 4) & empFT==1 &  female

      Source |       SS           df       MS      Number of obs   =    10,367
-------------+----------------------------------   F(4, 10362)     =    567.20
       Model |  492.073839         4   123.01846   Prob > F        =    0.0000
    Residual |  2247.40501    10,362  .216889115   R-squared       =    0.1796
-------------+----------------------------------   Adj R-squared   =    0.1793
       Total |  2739.47885    10,366  .264275405   Root MSE        =    .46571

------------------------------------------------------------------------------
      lnwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         hgc |   .0415082   .0035881    11.57   0.000     .0344749    .0485416
      gradHS |   .0758572   .0244559     3.10   0.002     .0279189    .1237955
     grad4yr |   .1331366   .0173733     7.66   0.000     .0990815    .1671916
    gradGrad |   .2122036   .0173583    12.22   0.000      .178178    .2462291
       _cons |   1.255781   .0404115    31.07   0.000     1.176567    1.334995
------------------------------------------------------------------------------

. 
. reg lnwage hgc c.potExp##c.potExp gradHS grad4yr gradGrad if cohortFlag==1979
>  & inrange(age,25,34) & empFT==1 & !female

      Source |       SS           df       MS      Number of obs   =    23,737
-------------+----------------------------------   F(6, 23730)     =    616.55
       Model |  804.347432         6  134.057905   Prob > F        =    0.0000
    Residual |  5159.65779    23,730   .21743185   R-squared       =    0.1349
-------------+----------------------------------   Adj R-squared   =    0.1346
       Total |  5964.00523    23,736  .251264123   Root MSE        =     .4663

------------------------------------------------------------------------------
      lnwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         hgc |   .0664265   .0027721    23.96   0.000      .060993    .0718601
      potExp |   .0484831   .0041386    11.71   0.000     .0403712    .0565951
             |
    c.potExp#|
    c.potExp |  -.0014501   .0001911    -7.59   0.000    -.0018247   -.0010754
             |
      gradHS |   .0315824   .0127187     2.48   0.013      .006653    .0565117
     grad4yr |   .1538896   .0137582    11.19   0.000     .1269227    .1808564
    gradGrad |   .0086196   .0430358     0.20   0.841    -.0757333    .0929725
       _cons |     .80423    .037971    21.18   0.000     .7298043    .8786556
------------------------------------------------------------------------------

. reg lnwage hgc c.potExp##c.potExp gradHS grad4yr gradGrad if cohortFlag==1997
>  & inrange(age,25,34) & empFT==1 & !female

      Source |       SS           df       MS      Number of obs   =    12,770
-------------+----------------------------------   F(6, 12763)     =    266.25
       Model |  448.765931         6  74.7943218   Prob > F        =    0.0000
    Residual |  3585.40889    12,763   .28092211   R-squared       =    0.1112
-------------+----------------------------------   Adj R-squared   =    0.1108
       Total |  4034.17482    12,769  .315935063   Root MSE        =    .53002

------------------------------------------------------------------------------
      lnwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         hgc |   .0587936   .0038668    15.20   0.000     .0512142    .0663731
      potExp |   .0625565   .0057288    10.92   0.000     .0513273    .0737858
             |
    c.potExp#|
    c.potExp |   -.001978   .0002898    -6.82   0.000    -.0025461   -.0014099
             |
      gradHS |   .0697908   .0198292     3.52   0.000     .0309226     .108659
     grad4yr |   .1471885   .0186068     7.91   0.000     .1107165    .1836606
    gradGrad |   .1530542   .0233983     6.54   0.000     .1071899    .1989184
       _cons |   .8578348   .0575665    14.90   0.000     .7449958    .9706738
------------------------------------------------------------------------------

. reg lnwage hgc c.potExp##c.potExp gradHS grad4yr gradGrad if cohortFlag==1979
>  & inrange(age,25,34) & empFT==1 &  female

      Source |       SS           df       MS      Number of obs   =    17,255
-------------+----------------------------------   F(6, 17248)     =    625.52
       Model |  670.554175         6  111.759029   Prob > F        =    0.0000
    Residual |  3081.64265    17,248  .178666666   R-squared       =    0.1787
-------------+----------------------------------   Adj R-squared   =    0.1784
       Total |  3752.19682    17,254  .217468229   Root MSE        =    .42269

------------------------------------------------------------------------------
      lnwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         hgc |   .0800646    .003033    26.40   0.000     .0741195    .0860097
      potExp |    .042512   .0045262     9.39   0.000     .0336402    .0513839
             |
    c.potExp#|
    c.potExp |   -.001399   .0002218    -6.31   0.000    -.0018337   -.0009643
             |
      gradHS |   .0668473   .0189171     3.53   0.000     .0297678    .1039269
     grad4yr |   .1253895    .013673     9.17   0.000     .0985891    .1521899
    gradGrad |   .0130509   .0426503     0.31   0.760    -.0705481    .0966499
       _cons |   .4569376   .0427213    10.70   0.000     .3731996    .5406756
------------------------------------------------------------------------------

. reg lnwage hgc c.potExp##c.potExp gradHS grad4yr gradGrad if cohortFlag==1997
>  & inrange(age,25,34) & empFT==1 &  female

      Source |       SS           df       MS      Number of obs   =    10,367
-------------+----------------------------------   F(6, 10360)     =    399.76
       Model |  515.014649         6  85.8357748   Prob > F        =    0.0000
    Residual |   2224.4642    10,360  .214716622   R-squared       =    0.1880
-------------+----------------------------------   Adj R-squared   =    0.1875
       Total |  2739.47885    10,366  .264275405   Root MSE        =    .46338

------------------------------------------------------------------------------
      lnwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         hgc |   .0564162   .0039124    14.42   0.000     .0487471    .0640853
      potExp |   .0356675   .0051565     6.92   0.000     .0255597    .0457753
             |
    c.potExp#|
    c.potExp |  -.0010891   .0002896    -3.76   0.000    -.0016569   -.0005214
             |
      gradHS |   .0665038   .0246196     2.70   0.007     .0182447     .114763
     grad4yr |   .1521242   .0174895     8.70   0.000     .1178414    .1864071
    gradGrad |   .2065795   .0174198    11.86   0.000     .1724334    .2407256
       _cons |   .8462619   .0565002    14.98   0.000     .7355107    .9570132
------------------------------------------------------------------------------

. 
. reg lnwage hgc c.exper##c.exper gradHS grad4yr gradGrad if cohortFlag==1979 &
>  inrange(age,25,34) & empFT==1 & !female

      Source |       SS           df       MS      Number of obs   =    23,737
-------------+----------------------------------   F(6, 23730)     =    826.80
       Model |  1031.20734         6   171.86789   Prob > F        =    0.0000
    Residual |  4932.79788    23,730  .207871803   R-squared       =    0.1729
-------------+----------------------------------   Adj R-squared   =    0.1727
       Total |  5964.00523    23,736  .251264123   Root MSE        =    .45593

------------------------------------------------------------------------------
      lnwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         hgc |   .0559063   .0025306    22.09   0.000     .0509461    .0608665
       exper |   .0607802   .0041342    14.70   0.000     .0526768    .0688835
             |
     c.exper#|
     c.exper |  -.0016193   .0002789    -5.81   0.000    -.0021659   -.0010726
             |
      gradHS |   .0120457   .0123651     0.97   0.330    -.0121908    .0362821
     grad4yr |   .1414503   .0129641    10.91   0.000     .1160397    .1668608
    gradGrad |   .0136579   .0419797     0.33   0.745     -.068625    .0959409
       _cons |   .9537054   .0288194    33.09   0.000     .8972175    1.010193
------------------------------------------------------------------------------

. reg lnwage hgc c.exper##c.exper gradHS grad4yr gradGrad if cohortFlag==1997 &
>  inrange(age,25,34) & empFT==1 & !female

      Source |       SS           df       MS      Number of obs   =    12,770
-------------+----------------------------------   F(6, 12763)     =    323.51
       Model |  532.545136         6  88.7575227   Prob > F        =    0.0000
    Residual |  3501.62968    12,763  .274357885   R-squared       =    0.1320
-------------+----------------------------------   Adj R-squared   =    0.1316
       Total |  4034.17482    12,769  .315935063   Root MSE        =    .52379

------------------------------------------------------------------------------
      lnwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         hgc |   .0344419   .0033969    10.14   0.000     .0277834    .0411003
       exper |  -.0046306    .007941    -0.58   0.560    -.0201962    .0109351
             |
     c.exper#|
     c.exper |   .0028297   .0004924     5.75   0.000     .0018645    .0037949
             |
      gradHS |   .0596366   .0194957     3.06   0.002     .0214221    .0978512
     grad4yr |   .1452914   .0179101     8.11   0.000     .1101849    .1803978
    gradGrad |   .1510984   .0229028     6.60   0.000     .1062054    .1959913
       _cons |   1.404237   .0461499    30.43   0.000     1.313776    1.494698
------------------------------------------------------------------------------

. reg lnwage hgc c.exper##c.exper gradHS grad4yr gradGrad if cohortFlag==1979 &
>  inrange(age,25,34) & empFT==1 &  female

      Source |       SS           df       MS      Number of obs   =    17,255
-------------+----------------------------------   F(6, 17248)     =    906.74
       Model |  899.734429         6  149.955738   Prob > F        =    0.0000
    Residual |  2852.46239    17,248  .165379313   R-squared       =    0.2398
-------------+----------------------------------   Adj R-squared   =    0.2395
       Total |  3752.19682    17,254  .217468229   Root MSE        =    .40667

------------------------------------------------------------------------------
      lnwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         hgc |   .0643152   .0027546    23.35   0.000     .0589159    .0697144
       exper |   .0655587    .004224    15.52   0.000     .0572793    .0738381
             |
     c.exper#|
     c.exper |   -.001721   .0002966    -5.80   0.000    -.0023023   -.0011398
             |
      gradHS |   .0142873   .0179752     0.79   0.427     -.020946    .0495206
     grad4yr |   .1279829   .0128547     9.96   0.000     .1027864    .1531793
    gradGrad |   .0168133    .040946     0.41   0.681     -.063445    .0970715
       _cons |    .640405   .0317312    20.18   0.000     .5782086    .7026014
------------------------------------------------------------------------------

. reg lnwage hgc c.exper##c.exper gradHS grad4yr gradGrad if cohortFlag==1997 &
>  inrange(age,25,34) & empFT==1 &  female

      Source |       SS           df       MS      Number of obs   =    10,367
-------------+----------------------------------   F(6, 10360)     =    446.37
       Model |  562.725667         6  93.7876111   Prob > F        =    0.0000
    Residual |  2176.75318    10,360  .210111311   R-squared       =    0.2054
-------------+----------------------------------   Adj R-squared   =    0.2050
       Total |  2739.47885    10,366  .264275405   Root MSE        =    .45838

------------------------------------------------------------------------------
      lnwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         hgc |    .038378   .0035364    10.85   0.000      .031446    .0453099
       exper |  -.0023232   .0083699    -0.28   0.781    -.0187299    .0140835
             |
     c.exper#|
     c.exper |   .0023046   .0005364     4.30   0.000     .0012532    .0033561
             |
      gradHS |   .0501994   .0241226     2.08   0.037     .0029144    .0974844
     grad4yr |   .1583063   .0171605     9.23   0.000     .1246683    .1919443
    gradGrad |   .2100682   .0170861    12.29   0.000     .1765761    .2435603
       _cons |   1.185788   .0490365    24.18   0.000     1.089667    1.281909
------------------------------------------------------------------------------

. 
. reg lnwage i.race hgc c.exper##c.exper gradHS grad4yr gradGrad if cohortFlag=
> =1979 & inrange(age,25,34) & empFT==1 & !female

      Source |       SS           df       MS      Number of obs   =    23,737
-------------+----------------------------------   F(9, 23727)     =    607.36
       Model |  1116.72008         9  124.080009   Prob > F        =    0.0000
    Residual |  4847.28515    23,727  .204294059   R-squared       =    0.1872
-------------+----------------------------------   Adj R-squared   =    0.1869
       Total |  5964.00523    23,736  .251264123   Root MSE        =    .45199

------------------------------------------------------------------------------
      lnwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        race |
      Black  |  -.1431869   .0072121   -19.85   0.000     -.157323   -.1290508
   Hispanic  |   -.033032   .0079537    -4.15   0.000    -.0486218   -.0174422
      Asian  |   .3394648   .0826306     4.11   0.000     .1775035     .501426
             |
         hgc |    .056614   .0025153    22.51   0.000     .0516839    .0615441
       exper |   .0571452   .0041025    13.93   0.000      .049104    .0651864
             |
     c.exper#|
     c.exper |  -.0015818   .0002765    -5.72   0.000    -.0021237   -.0010398
             |
      gradHS |    .005254   .0122801     0.43   0.669    -.0188157    .0293237
     grad4yr |    .118819   .0128997     9.21   0.000     .0935347    .1441033
    gradGrad |   .0012786   .0416227     0.03   0.975    -.0803045    .0828617
       _cons |   1.020285   .0291395    35.01   0.000     .9631697      1.0774
------------------------------------------------------------------------------

. reg lnwage i.race hgc c.exper##c.exper gradHS grad4yr gradGrad if cohortFlag=
> =1997 & inrange(age,25,34) & empFT==1 & !female

      Source |       SS           df       MS      Number of obs   =    12,770
-------------+----------------------------------   F(10, 12759)    =    210.08
       Model |  570.334168        10  57.0334168   Prob > F        =    0.0000
    Residual |  3463.84065    12,759  .271482142   R-squared       =    0.1414
-------------+----------------------------------   Adj R-squared   =    0.1407
       Total |  4034.17482    12,769  .315935063   Root MSE        =    .52104

------------------------------------------------------------------------------
      lnwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        race |
      Black  |  -.1317446   .0122906   -10.72   0.000    -.1558361   -.1076531
   Hispanic  |  -.0078029   .0118738    -0.66   0.511    -.0310774    .0154716
      Asian  |   .0840987   .0283273     2.97   0.003      .028573    .1396244
      Mixed  |   .0176543   .0472352     0.37   0.709    -.0749337    .1102424
             |
         hgc |   .0333924    .003382     9.87   0.000     .0267632    .0400217
       exper |  -.0068178   .0079027    -0.86   0.388    -.0223083    .0086728
             |
     c.exper#|
     c.exper |   .0028128   .0004898     5.74   0.000     .0018526    .0037729
             |
      gradHS |   .0659903   .0194626     3.39   0.001     .0278407    .1041399
     grad4yr |   .1341443   .0179415     7.48   0.000     .0989763    .1693123
    gradGrad |   .1421726    .022822     6.23   0.000     .0974382    .1869071
       _cons |   1.461106   .0464182    31.48   0.000      1.37012    1.552093
------------------------------------------------------------------------------

. reg lnwage i.race hgc c.exper##c.exper gradHS grad4yr gradGrad if cohortFlag=
> =1979 & inrange(age,25,34) & empFT==1 &  female

      Source |       SS           df       MS      Number of obs   =    17,255
-------------+----------------------------------   F(9, 17245)     =    628.01
       Model |  926.224233         9  102.913804   Prob > F        =    0.0000
    Residual |  2825.97259    17,245  .163871997   R-squared       =    0.2468
-------------+----------------------------------   Adj R-squared   =    0.2465
       Total |  3752.19682    17,254  .217468229   Root MSE        =    .40481

------------------------------------------------------------------------------
      lnwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        race |
      Black  |   -.079464   .0072079   -11.02   0.000    -.0935923   -.0653358
   Hispanic  |   .0197267   .0085408     2.31   0.021     .0029858    .0364675
      Asian  |  -.2568656   .1221448    -2.10   0.035    -.4962819   -.0174494
             |
         hgc |   .0670905   .0027513    24.38   0.000     .0616976    .0724834
       exper |   .0623632   .0042144    14.80   0.000     .0541026    .0706239
             |
     c.exper#|
     c.exper |  -.0015872   .0002954    -5.37   0.000    -.0021663   -.0010081
             |
      gradHS |   .0150824   .0179202     0.84   0.400     -.020043    .0502078
     grad4yr |   .1137763   .0129051     8.82   0.000     .0884811    .1390716
    gradGrad |   .0046799   .0407701     0.11   0.909    -.0752337    .0845935
       _cons |   .6396349   .0317884    20.12   0.000     .5773264    .7019435
------------------------------------------------------------------------------

. reg lnwage i.race hgc c.exper##c.exper gradHS grad4yr gradGrad if cohortFlag=
> =1997 & inrange(age,25,34) & empFT==1 &  female

      Source |       SS           df       MS      Number of obs   =    10,367
-------------+----------------------------------   F(10, 10356)    =    304.90
       Model |  623.096772        10  62.3096772   Prob > F        =    0.0000
    Residual |  2116.38208    10,356  .204362889   R-squared       =    0.2275
-------------+----------------------------------   Adj R-squared   =    0.2267
       Total |  2739.47885    10,366  .264275405   Root MSE        =    .45207

------------------------------------------------------------------------------
      lnwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        race |
      Black  |  -.1152875   .0108636   -10.61   0.000    -.1365822   -.0939927
   Hispanic  |   .0275105    .011957     2.30   0.021     .0040725    .0509484
      Asian  |   .2766641   .0266661    10.38   0.000     .2243934    .3289349
      Mixed  |   .1446659   .0533637     2.71   0.007     .0400627    .2492691
             |
         hgc |   .0402853   .0035015    11.51   0.000     .0334217    .0471489
       exper |  -.0016125    .008258    -0.20   0.845    -.0177998    .0145748
             |
     c.exper#|
     c.exper |   .0022246   .0005291     4.20   0.000     .0011875    .0032617
             |
      gradHS |   .0491779   .0238228     2.06   0.039     .0024805    .0958752
     grad4yr |   .1363489   .0170771     7.98   0.000     .1028745    .1698233
    gradGrad |   .2098612   .0168528    12.45   0.000     .1768265     .242896
       _cons |   1.184583   .0490964    24.13   0.000     1.088345    1.280821
------------------------------------------------------------------------------

. 
. save yCombined.dta, replace
(note: file yCombined.dta not found)
file yCombined.dta saved

. !gzip -f yCombined.dta


. save yCombinedAnalysis.dta, replace
(note: file yCombinedAnalysis.dta not found)
file yCombinedAnalysis.dta saved

. !gzip -f yCombinedAnalysis.dta


. 
. log close
      name:  <unnamed>
       log:  /home/data/ransom/NLSYvCPS/Data/NLSY/data_append.log
  log type:  text
 closed on:  11 Feb 2019, 12:00:15
-------------------------------------------------------------------------------
