-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/data/ransom/NLSYvCPS/Analysis/all_freqs.log
  log type:  text
 opened on:  13 Feb 2019, 12:14:56

. 
. local DATALIST ACS CPS NLSY PSID SIPP

. 
. gen dataset=""

. foreach DATA in `DATALIST' {
  2.     disp "`DATA'"
  3.     local data = lower("`DATA'")
  4.     append using `DATA'/`data'_means.dta, gen(`DATA')
  5.     replace dataset="`DATA'" if `DATA'==1
  6. }
ACS
variable dataset was str1 now str3
(10,032 real changes made)
CPS
(10,752 real changes made)
NLSY
variable dataset was str3 now str4
(3,264 real changes made)
PSID
(10,980 real changes made)
SIPP
(9,504 real changes made)

. recode `DATALIST' (.=0)
(ACS: 34500 changes made)
(CPS: 23748 changes made)
(NLSY: 20484 changes made)
(PSID: 9504 changes made)
(SIPP: 0 changes made)

. order  `DATALIST' dataset, last

. 
. lab var birthyr "Birth year"

. 
. duplicates drop

Duplicates in terms of all variables

(9,270 observations deleted)

. 
. keep if inrange(birthyr,1950,1985) & empFT==99 & controls=="Grad4yr" & age1==
> 25 
(34,948 observations deleted)

. 
. replace N=. if dataset=="ACS" & (inrange(birthyr,1952,1959) | inrange(birthyr
> ,1962,1969))
(32 real changes made, 32 to missing)

. replace N=. if dataset=="SIPP" & inrange(birthyr,1983,2000)
(6 real changes made, 6 to missing)

. 
. tabout birthyr dataset if female==0 using allFreqsMen.tex, replace style(tex)
>  bt c(mean N) f(0c) sum h1(nil) h3(nil) // fn(auto.dta)

Table output written to: allFreqsMen.tex

Birth year&ACS&CPS&NLSY&PSID&SIPP&Total \\
\midrule
1950&91,646&23,647&&837&304&29,108 \\
1951&92,773&27,524&&864&564&30,431 \\
1952&&31,252&&1,100&742&11,031 \\
1953&&35,219&&1,024&1,251&12,498 \\
1954&&37,812&&1,190&1,640&13,547 \\
1955&&37,449&&1,162&1,556&13,389 \\
1956&&36,947&&1,197&2,099&13,414 \\
1957&&37,270&4,054&965&2,693&11,246 \\
1958&&36,138&4,484&1,175&3,272&11,267 \\
1959&&35,174&4,609&1,092&4,094&11,242 \\
1960&110,358&35,620&5,404&1,198&4,461&31,408 \\
1961&105,433&33,976&5,370&1,162&3,881&29,964 \\
1962&&32,462&5,162&1,009&4,285&10,730 \\
1963&&31,421&4,917&885&4,649&10,468 \\
1964&&30,091&3,650&839&4,810&9,848 \\
1965&&27,968&&692&4,728&11,129 \\
1966&&26,684&&645&4,055&10,461 \\
1967&&25,197&&603&3,946&9,915 \\
1968&&25,427&&509&3,836&9,924 \\
1969&&26,045&&401&3,804&10,083 \\
1970&131,305&26,465&&464&3,839&40,518 \\
1971&147,774&25,514&&335&4,243&44,466 \\
1972&156,042&23,948&&389&4,126&46,126 \\
1973&165,239&22,669&&315&3,594&47,954 \\
1974&174,451&23,317&&413&3,509&50,422 \\
1975&194,287&23,828&&393&3,700&55,552 \\
1976&122,506&23,776&&402&3,852&37,634 \\
1977&134,475&24,128&&442&3,915&40,740 \\
1978&146,456&24,079&&488&3,727&43,688 \\
1979&158,486&24,844&&568&3,685&46,896 \\
1980&175,461&25,549&5,246&568&3,153&41,995 \\
1981&179,464&25,190&5,241&518&2,577&42,598 \\
1982&180,059&23,695&4,501&486&2,108&42,170 \\
1983&162,565&20,543&3,746&457&&46,828 \\
1984&142,781&18,403&2,933&556&&41,168 \\
1985&127,479&15,902&&366&&47,916 \\
Total&144,952&27,921&4,563&714&3,233&29,681 \\

. tabout birthyr dataset if female==1 using allFreqsWomen.tex, replace style(te
> x) bt c(mean N) f(0c) sum h1(nil) h3(nil) // fn(auto.dta)

Table output written to: allFreqsWomen.tex

Birth year&ACS&CPS&NLSY&PSID&SIPP&Total \\
\midrule
1950&94,059&25,695&&1,035&310&30,275 \\
1951&94,502&29,976&&1,107&614&31,550 \\
1952&&34,479&&1,052&807&12,113 \\
1953&&38,432&&1,142&1,339&13,638 \\
1954&&41,005&&1,400&1,787&14,731 \\
1955&&40,726&&1,272&1,845&14,614 \\
1956&&40,706&&1,397&2,375&14,826 \\
1957&&40,726&5,069&1,131&3,034&12,490 \\
1958&&39,407&5,076&1,245&3,820&12,387 \\
1959&&39,757&5,438&1,217&4,520&12,733 \\
1960&113,339&39,314&5,379&1,192&4,995&32,844 \\
1961&108,970&37,751&5,687&1,185&4,594&31,637 \\
1962&&35,943&5,138&1,292&4,912&11,821 \\
1963&&34,306&4,787&1,083&5,036&11,303 \\
1964&&33,125&3,379&968&5,167&10,660 \\
1965&&30,864&&878&5,565&12,436 \\
1966&&28,619&&759&4,719&11,366 \\
1967&&27,768&&505&4,398&10,890 \\
1968&&27,715&&516&4,529&10,920 \\
1969&&27,956&&455&3,942&10,784 \\
1970&132,612&29,219&&500&4,055&41,596 \\
1971&153,882&27,593&&482&5,066&46,756 \\
1972&161,721&25,819&&389&4,701&48,158 \\
1973&172,583&24,833&&383&4,314&50,528 \\
1974&178,930&25,207&&376&4,085&52,150 \\
1975&197,513&25,681&&527&4,221&56,986 \\
1976&128,542&26,058&&475&4,456&39,883 \\
1977&140,810&26,019&&501&4,576&42,976 \\
1978&153,031&26,113&&571&4,438&46,038 \\
1979&163,748&26,646&&552&4,086&48,758 \\
1980&180,352&27,427&5,430&717&3,613&43,508 \\
1981&181,209&26,768&5,243&616&3,077&43,383 \\
1982&181,922&25,805&4,557&570&2,699&43,111 \\
1983&163,803&22,709&3,598&509&&47,655 \\
1984&143,293&19,783&2,859&502&&41,609 \\
1985&126,687&17,009&&437&&48,044 \\
Total&148,575&30,471&4,742&804&3,688&31,020 \\

. 
. * !sed -i -e '1i\\toprule\' allFreqsMen.tex
. !sed -i -e '\$i\\bottomrule\' allFreqsMen.tex


. !sed -i -e '$ d' allFreqsMen.tex


. * !sed -i -e '\$a\\bottomrule\' allFreqsMen.tex
. * !sed -i -e '1i\\toprule\' allFreqsWomen.tex
. !sed -i -e '\$i\\bottomrule\' allFreqsWomen.tex


. !sed -i -e '$ d' allFreqsWomen.tex


. * !sed -i -e '\$a\\bottomrule\' allFreqsWomen.tex
. 
. 
. *** Now add wage frequencies
. 
. clear

. 
. gen dataset=""

. foreach DATA in `DATALIST' {
  2.     disp "`DATA'"
  3.     local data = lower("`DATA'")
  4.     append using `DATA'/`data'_regs.dta, gen(`DATA')
  5.     replace dataset="`DATA'" if `DATA'==1
  6. }
ACS
variable dataset was str1 now str3
(5,434 real changes made)
CPS
(4,480 real changes made)
NLSY
variable dataset was str3 now str4
(1,496 real changes made)
PSID
(5,954 real changes made)
SIPP
(4,708 real changes made)

. recode `DATALIST' (.=0)
(ACS: 16638 changes made)
(CPS: 12158 changes made)
(NLSY: 10662 changes made)
(PSID: 4708 changes made)
(SIPP: 0 changes made)

. order  `DATALIST' dataset, last

. 
. lab var birthyr "Birth year"

. 
. duplicates drop

Duplicates in terms of all variables

(0 observations are duplicates)

. 
. keep if inrange(birthyr,1950,1985) & empFT==1 & controls=="Raw" & age1==25 
(21,758 observations deleted)

. 
. replace N=. if dataset=="ACS" & (inrange(birthyr,1952,1959) | inrange(birthyr
> ,1962,1969))
(32 real changes made, 32 to missing)

. replace N=. if dataset=="SIPP" & inrange(birthyr,1983,2000)
(6 real changes made, 6 to missing)

. 
. tabout birthyr dataset if female==0 using wageFreqsMen.tex, replace style(tex
> ) bt c(mean N) f(0c) sum h1(nil) h3(nil) // fn(auto.dta)

Table output written to: wageFreqsMen.tex

Birth year&ACS&CPS&NLSY&PSID&SIPP&Total \\
\midrule
1950&66,625&17,214&&561&203&21,151 \\
1951&66,253&20,110&&613&401&21,844 \\
1952&&22,662&&777&538&7,992 \\
1953&&25,383&&754&924&9,020 \\
1954&&27,086&&814&1,187&9,696 \\
1955&&27,001&&792&1,178&9,657 \\
1956&&26,794&&800&1,547&9,714 \\
1957&&26,988&2,528&623&2,002&8,035 \\
1958&&26,488&2,893&718&2,374&8,118 \\
1959&&25,712&2,837&645&2,999&8,048 \\
1960&79,975&25,733&3,406&708&3,245&22,613 \\
1961&75,920&24,242&3,354&615&2,852&21,397 \\
1962&&23,105&3,178&617&3,125&7,506 \\
1963&&22,160&3,062&492&3,376&7,272 \\
1964&&20,866&2,188&478&3,577&6,777 \\
1965&&19,189&&348&3,523&7,687 \\
1966&&18,187&&348&3,010&7,182 \\
1967&&17,120&&343&2,897&6,787 \\
1968&&17,250&&285&2,869&6,801 \\
1969&&17,375&&268&2,840&6,828 \\
1970&96,385&17,836&&298&2,838&29,339 \\
1971&108,752&17,297&&221&3,177&32,362 \\
1972&112,965&16,259&&264&3,065&33,138 \\
1973&117,819&15,279&&223&2,652&33,993 \\
1974&122,604&15,573&&246&2,581&35,251 \\
1975&134,186&15,717&&268&2,646&38,204 \\
1976&86,364&15,423&&266&2,767&26,205 \\
1977&92,406&15,584&&316&2,766&27,768 \\
1978&98,789&15,547&&307&2,650&29,323 \\
1979&105,338&15,773&&340&2,512&30,991 \\
1980&114,732&16,467&3,196&353&2,155&27,381 \\
1981&116,030&16,078&3,090&320&1,691&27,442 \\
1982&116,156&14,960&2,596&281&1,399&27,078 \\
1983&102,912&12,870&2,103&258&&29,536 \\
1984&88,932&11,590&1,618&287&&25,607 \\
1985&77,750&9,862&&182&&29,265 \\
Total&99,045&19,244&2,773&445&2,350&20,314 \\

. tabout birthyr dataset if female==1 using wageFreqsWomen.tex, replace style(t
> ex) bt c(mean N) f(0c) sum h1(nil) h3(nil) // fn(auto.dta)

Table output written to: wageFreqsWomen.tex

Birth year&ACS&CPS&NLSY&PSID&SIPP&Total \\
\midrule
1950&35,051&11,182&&445&127&11,701 \\
1951&36,125&13,383&&401&265&12,544 \\
1952&&15,548&&406&316&5,423 \\
1953&&17,731&&512&614&6,286 \\
1954&&19,092&&635&759&6,829 \\
1955&&19,128&&573&823&6,841 \\
1956&&19,599&&622&1,072&7,098 \\
1957&&19,913&2,050&441&1,466&5,968 \\
1958&&19,366&2,027&548&1,850&5,948 \\
1959&&19,675&2,241&508&2,209&6,158 \\
1960&52,050&19,440&2,245&474&2,330&15,308 \\
1961&51,151&18,496&2,564&488&2,254&14,991 \\
1962&&17,720&2,191&525&2,433&5,717 \\
1963&&16,639&2,048&440&2,518&5,411 \\
1964&&15,879&1,591&388&2,610&5,117 \\
1965&&14,470&&424&2,988&5,961 \\
1966&&13,285&&300&2,329&5,305 \\
1967&&13,015&&226&2,175&5,139 \\
1968&&12,619&&227&2,246&5,031 \\
1969&&12,853&&219&2,090&5,054 \\
1970&66,768&13,484&&263&2,105&20,655 \\
1971&77,912&12,905&&258&2,648&23,431 \\
1972&81,530&12,068&&196&2,498&24,073 \\
1973&86,323&11,431&&203&2,229&25,046 \\
1974&90,034&11,848&&207&2,143&26,058 \\
1975&98,920&11,897&&315&2,134&28,316 \\
1976&64,832&12,249&&232&2,342&19,914 \\
1977&70,358&12,028&&285&2,291&21,240 \\
1978&76,809&11,919&&317&2,214&22,815 \\
1979&81,788&12,229&&267&2,123&24,102 \\
1980&90,123&12,642&2,596&374&1,790&21,505 \\
1981&91,134&12,503&2,508&341&1,528&21,603 \\
1982&92,248&11,847&2,175&307&1,379&21,591 \\
1983&82,657&10,526&1,671&249&&23,776 \\
1984&71,581&9,126&1,297&275&&20,570 \\
1985&63,269&8,027&&240&&23,845 \\
Total&73,033&14,327&2,093&365&1,845&15,055 \\

. 
. * !sed -i -e '1i\\toprule\' wageFreqsMen.tex
. !sed -i -e '\$i\\bottomrule\' wageFreqsMen.tex


. !sed -i -e '$ d' wageFreqsMen.tex


. * !sed -i -e '\$a\\bottomrule\' wageFreqsMen.tex
. * !sed -i -e '1i\\toprule\' wageFreqsWomen.tex
. !sed -i -e '\$i\\bottomrule\' wageFreqsWomen.tex


. !sed -i -e '$ d' wageFreqsWomen.tex


. * !sed -i -e '\$a\\bottomrule\' wageFreqsWomen.tex
. 
. log close
      name:  <unnamed>
       log:  /home/data/ransom/NLSYvCPS/Analysis/all_freqs.log
  log type:  text
 closed on:  13 Feb 2019, 12:14:57
-------------------------------------------------------------------------------
